hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
/*
; stm32N657_dma2d.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_dma2d equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// DMA2D address definitions
// -------------------------

typedef struct {
	volatile	uint32_t	CR;
	volatile	uint32_t	ISR;
	volatile	uint32_t	IFCR;
	volatile	uint32_t	FGMAR;
	volatile	uint32_t	FGOR;
	volatile	uint32_t	BGMAR;
	volatile	uint32_t	BGOR;
	volatile	uint32_t	FGPFCCR;
	volatile	uint32_t	FGCOLR;
	volatile	uint32_t	BGPFCCR;
	volatile	uint32_t	BGCOLR;
	volatile	uint32_t	FGCMAR;
	volatile	uint32_t	BGCMAR;
	volatile	uint32_t	OPFCCR;
	volatile	uint32_t	OCOLR;
	volatile	uint32_t	OMAR;
	volatile	uint32_t	OOR;
	volatile	uint32_t	NLR;
	volatile	uint32_t	LWR;
	volatile	uint32_t	AMTCR;
	volatile	uint32_t	RESERVED0[236];
	volatile	uint32_t	FGCLUT0;
	volatile	uint32_t	FGCLUT1;
	volatile	uint32_t	FGCLUT2;
	volatile	uint32_t	FGCLUT3;
	volatile	uint32_t	FGCLUT4;
	volatile	uint32_t	FGCLUT5;
	volatile	uint32_t	FGCLUT6;
	volatile	uint32_t	FGCLUT7;
	volatile	uint32_t	FGCLUT8;
	volatile	uint32_t	FGCLUT9;
	volatile	uint32_t	FGCLUT10;
	volatile	uint32_t	FGCLUT11;
	volatile	uint32_t	FGCLUT12;
	volatile	uint32_t	FGCLUT13;
	volatile	uint32_t	FGCLUT14;
	volatile	uint32_t	FGCLUT15;
	volatile	uint32_t	FGCLUT16;
	volatile	uint32_t	FGCLUT17;
	volatile	uint32_t	FGCLUT18;
	volatile	uint32_t	FGCLUT19;
	volatile	uint32_t	FGCLUT20;
	volatile	uint32_t	FGCLUT21;
	volatile	uint32_t	FGCLUT22;
	volatile	uint32_t	FGCLUT23;
	volatile	uint32_t	FGCLUT24;
	volatile	uint32_t	FGCLUT25;
	volatile	uint32_t	FGCLUT26;
	volatile	uint32_t	FGCLUT27;
	volatile	uint32_t	FGCLUT28;
	volatile	uint32_t	FGCLUT29;
	volatile	uint32_t	FGCLUT30;
	volatile	uint32_t	FGCLUT31;
	volatile	uint32_t	FGCLUT32;
	volatile	uint32_t	FGCLUT33;
	volatile	uint32_t	FGCLUT34;
	volatile	uint32_t	FGCLUT35;
	volatile	uint32_t	FGCLUT36;
	volatile	uint32_t	FGCLUT37;
	volatile	uint32_t	FGCLUT38;
	volatile	uint32_t	FGCLUT39;
	volatile	uint32_t	FGCLUT40;
	volatile	uint32_t	FGCLUT41;
	volatile	uint32_t	FGCLUT42;
	volatile	uint32_t	FGCLUT43;
	volatile	uint32_t	FGCLUT44;
	volatile	uint32_t	FGCLUT45;
	volatile	uint32_t	FGCLUT46;
	volatile	uint32_t	FGCLUT47;
	volatile	uint32_t	FGCLUT48;
	volatile	uint32_t	FGCLUT49;
	volatile	uint32_t	FGCLUT50;
	volatile	uint32_t	FGCLUT51;
	volatile	uint32_t	FGCLUT52;
	volatile	uint32_t	FGCLUT53;
	volatile	uint32_t	FGCLUT54;
	volatile	uint32_t	FGCLUT55;
	volatile	uint32_t	FGCLUT56;
	volatile	uint32_t	FGCLUT57;
	volatile	uint32_t	FGCLUT58;
	volatile	uint32_t	FGCLUT59;
	volatile	uint32_t	FGCLUT60;
	volatile	uint32_t	FGCLUT61;
	volatile	uint32_t	FGCLUT62;
	volatile	uint32_t	FGCLUT63;
	volatile	uint32_t	FGCLUT64;
	volatile	uint32_t	FGCLUT65;
	volatile	uint32_t	FGCLUT66;
	volatile	uint32_t	FGCLUT67;
	volatile	uint32_t	FGCLUT68;
	volatile	uint32_t	FGCLUT69;
	volatile	uint32_t	FGCLUT70;
	volatile	uint32_t	FGCLUT71;
	volatile	uint32_t	FGCLUT72;
	volatile	uint32_t	FGCLUT73;
	volatile	uint32_t	FGCLUT74;
	volatile	uint32_t	FGCLUT75;
	volatile	uint32_t	FGCLUT76;
	volatile	uint32_t	FGCLUT77;
	volatile	uint32_t	FGCLUT78;
	volatile	uint32_t	FGCLUT79;
	volatile	uint32_t	FGCLUT80;
	volatile	uint32_t	FGCLUT81;
	volatile	uint32_t	FGCLUT82;
	volatile	uint32_t	FGCLUT83;
	volatile	uint32_t	FGCLUT84;
	volatile	uint32_t	FGCLUT85;
	volatile	uint32_t	FGCLUT86;
	volatile	uint32_t	FGCLUT87;
	volatile	uint32_t	FGCLUT88;
	volatile	uint32_t	FGCLUT89;
	volatile	uint32_t	FGCLUT90;
	volatile	uint32_t	FGCLUT91;
	volatile	uint32_t	FGCLUT92;
	volatile	uint32_t	FGCLUT93;
	volatile	uint32_t	FGCLUT94;
	volatile	uint32_t	FGCLUT95;
	volatile	uint32_t	FGCLUT96;
	volatile	uint32_t	FGCLUT97;
	volatile	uint32_t	FGCLUT98;
	volatile	uint32_t	FGCLUT99;
	volatile	uint32_t	FGCLUT100;
	volatile	uint32_t	FGCLUT101;
	volatile	uint32_t	FGCLUT102;
	volatile	uint32_t	FGCLUT103;
	volatile	uint32_t	FGCLUT104;
	volatile	uint32_t	FGCLUT105;
	volatile	uint32_t	FGCLUT106;
	volatile	uint32_t	FGCLUT107;
	volatile	uint32_t	FGCLUT108;
	volatile	uint32_t	FGCLUT109;
	volatile	uint32_t	FGCLUT110;
	volatile	uint32_t	FGCLUT111;
	volatile	uint32_t	FGCLUT112;
	volatile	uint32_t	FGCLUT113;
	volatile	uint32_t	FGCLUT114;
	volatile	uint32_t	FGCLUT115;
	volatile	uint32_t	FGCLUT116;
	volatile	uint32_t	FGCLUT117;
	volatile	uint32_t	FGCLUT118;
	volatile	uint32_t	FGCLUT119;
	volatile	uint32_t	FGCLUT120;
	volatile	uint32_t	FGCLUT121;
	volatile	uint32_t	FGCLUT122;
	volatile	uint32_t	FGCLUT123;
	volatile	uint32_t	FGCLUT124;
	volatile	uint32_t	FGCLUT125;
	volatile	uint32_t	FGCLUT126;
	volatile	uint32_t	FGCLUT127;
	volatile	uint32_t	FGCLUT128;
	volatile	uint32_t	FGCLUT129;
	volatile	uint32_t	FGCLUT130;
	volatile	uint32_t	FGCLUT131;
	volatile	uint32_t	FGCLUT132;
	volatile	uint32_t	FGCLUT133;
	volatile	uint32_t	FGCLUT134;
	volatile	uint32_t	FGCLUT135;
	volatile	uint32_t	FGCLUT136;
	volatile	uint32_t	FGCLUT137;
	volatile	uint32_t	FGCLUT138;
	volatile	uint32_t	FGCLUT139;
	volatile	uint32_t	FGCLUT140;
	volatile	uint32_t	FGCLUT141;
	volatile	uint32_t	FGCLUT142;
	volatile	uint32_t	FGCLUT143;
	volatile	uint32_t	FGCLUT144;
	volatile	uint32_t	FGCLUT145;
	volatile	uint32_t	FGCLUT146;
	volatile	uint32_t	FGCLUT147;
	volatile	uint32_t	FGCLUT148;
	volatile	uint32_t	FGCLUT149;
	volatile	uint32_t	FGCLUT150;
	volatile	uint32_t	FGCLUT151;
	volatile	uint32_t	FGCLUT152;
	volatile	uint32_t	FGCLUT153;
	volatile	uint32_t	FGCLUT154;
	volatile	uint32_t	FGCLUT155;
	volatile	uint32_t	FGCLUT156;
	volatile	uint32_t	FGCLUT157;
	volatile	uint32_t	FGCLUT158;
	volatile	uint32_t	FGCLUT159;
	volatile	uint32_t	FGCLUT160;
	volatile	uint32_t	FGCLUT161;
	volatile	uint32_t	FGCLUT162;
	volatile	uint32_t	FGCLUT163;
	volatile	uint32_t	FGCLUT164;
	volatile	uint32_t	FGCLUT165;
	volatile	uint32_t	FGCLUT166;
	volatile	uint32_t	FGCLUT167;
	volatile	uint32_t	FGCLUT168;
	volatile	uint32_t	FGCLUT169;
	volatile	uint32_t	FGCLUT170;
	volatile	uint32_t	FGCLUT171;
	volatile	uint32_t	FGCLUT172;
	volatile	uint32_t	FGCLUT173;
	volatile	uint32_t	FGCLUT174;
	volatile	uint32_t	FGCLUT175;
	volatile	uint32_t	FGCLUT176;
	volatile	uint32_t	FGCLUT177;
	volatile	uint32_t	FGCLUT178;
	volatile	uint32_t	FGCLUT179;
	volatile	uint32_t	FGCLUT180;
	volatile	uint32_t	FGCLUT181;
	volatile	uint32_t	FGCLUT182;
	volatile	uint32_t	FGCLUT183;
	volatile	uint32_t	FGCLUT184;
	volatile	uint32_t	FGCLUT185;
	volatile	uint32_t	FGCLUT186;
	volatile	uint32_t	FGCLUT187;
	volatile	uint32_t	FGCLUT188;
	volatile	uint32_t	FGCLUT189;
	volatile	uint32_t	FGCLUT190;
	volatile	uint32_t	FGCLUT191;
	volatile	uint32_t	FGCLUT192;
	volatile	uint32_t	FGCLUT193;
	volatile	uint32_t	FGCLUT194;
	volatile	uint32_t	FGCLUT195;
	volatile	uint32_t	FGCLUT196;
	volatile	uint32_t	FGCLUT197;
	volatile	uint32_t	FGCLUT198;
	volatile	uint32_t	FGCLUT199;
	volatile	uint32_t	FGCLUT200;
	volatile	uint32_t	FGCLUT201;
	volatile	uint32_t	FGCLUT202;
	volatile	uint32_t	FGCLUT203;
	volatile	uint32_t	FGCLUT204;
	volatile	uint32_t	FGCLUT205;
	volatile	uint32_t	FGCLUT206;
	volatile	uint32_t	FGCLUT207;
	volatile	uint32_t	FGCLUT208;
	volatile	uint32_t	FGCLUT209;
	volatile	uint32_t	FGCLUT210;
	volatile	uint32_t	FGCLUT211;
	volatile	uint32_t	FGCLUT212;
	volatile	uint32_t	FGCLUT213;
	volatile	uint32_t	FGCLUT214;
	volatile	uint32_t	FGCLUT215;
	volatile	uint32_t	FGCLUT216;
	volatile	uint32_t	FGCLUT217;
	volatile	uint32_t	FGCLUT218;
	volatile	uint32_t	FGCLUT219;
	volatile	uint32_t	FGCLUT220;
	volatile	uint32_t	FGCLUT221;
	volatile	uint32_t	FGCLUT222;
	volatile	uint32_t	FGCLUT223;
	volatile	uint32_t	FGCLUT224;
	volatile	uint32_t	FGCLUT225;
	volatile	uint32_t	FGCLUT226;
	volatile	uint32_t	FGCLUT227;
	volatile	uint32_t	FGCLUT228;
	volatile	uint32_t	FGCLUT229;
	volatile	uint32_t	FGCLUT230;
	volatile	uint32_t	FGCLUT231;
	volatile	uint32_t	FGCLUT232;
	volatile	uint32_t	FGCLUT233;
	volatile	uint32_t	FGCLUT234;
	volatile	uint32_t	FGCLUT235;
	volatile	uint32_t	FGCLUT236;
	volatile	uint32_t	FGCLUT237;
	volatile	uint32_t	FGCLUT238;
	volatile	uint32_t	FGCLUT239;
	volatile	uint32_t	FGCLUT240;
	volatile	uint32_t	FGCLUT241;
	volatile	uint32_t	FGCLUT242;
	volatile	uint32_t	FGCLUT243;
	volatile	uint32_t	FGCLUT244;
	volatile	uint32_t	FGCLUT245;
	volatile	uint32_t	FGCLUT246;
	volatile	uint32_t	FGCLUT247;
	volatile	uint32_t	FGCLUT248;
	volatile	uint32_t	FGCLUT249;
	volatile	uint32_t	FGCLUT250;
	volatile	uint32_t	FGCLUT251;
	volatile	uint32_t	FGCLUT252;
	volatile	uint32_t	FGCLUT253;
	volatile	uint32_t	FGCLUT254;
	volatile	uint32_t	FGCLUT255;
	volatile	uint32_t	BGCLUT0;
	volatile	uint32_t	BGCLUT1;
	volatile	uint32_t	BGCLUT2;
	volatile	uint32_t	BGCLUT3;
	volatile	uint32_t	BGCLUT4;
	volatile	uint32_t	BGCLUT5;
	volatile	uint32_t	BGCLUT6;
	volatile	uint32_t	BGCLUT7;
	volatile	uint32_t	BGCLUT8;
	volatile	uint32_t	BGCLUT9;
	volatile	uint32_t	BGCLUT10;
	volatile	uint32_t	BGCLUT11;
	volatile	uint32_t	BGCLUT12;
	volatile	uint32_t	BGCLUT13;
	volatile	uint32_t	BGCLUT14;
	volatile	uint32_t	BGCLUT15;
	volatile	uint32_t	BGCLUT16;
	volatile	uint32_t	BGCLUT17;
	volatile	uint32_t	BGCLUT18;
	volatile	uint32_t	BGCLUT19;
	volatile	uint32_t	BGCLUT20;
	volatile	uint32_t	BGCLUT21;
	volatile	uint32_t	BGCLUT22;
	volatile	uint32_t	BGCLUT23;
	volatile	uint32_t	BGCLUT24;
	volatile	uint32_t	BGCLUT25;
	volatile	uint32_t	BGCLUT26;
	volatile	uint32_t	BGCLUT27;
	volatile	uint32_t	BGCLUT28;
	volatile	uint32_t	BGCLUT29;
	volatile	uint32_t	BGCLUT30;
	volatile	uint32_t	BGCLUT31;
	volatile	uint32_t	BGCLUT32;
	volatile	uint32_t	BGCLUT33;
	volatile	uint32_t	BGCLUT34;
	volatile	uint32_t	BGCLUT35;
	volatile	uint32_t	BGCLUT36;
	volatile	uint32_t	BGCLUT37;
	volatile	uint32_t	BGCLUT38;
	volatile	uint32_t	BGCLUT39;
	volatile	uint32_t	BGCLUT40;
	volatile	uint32_t	BGCLUT41;
	volatile	uint32_t	BGCLUT42;
	volatile	uint32_t	BGCLUT43;
	volatile	uint32_t	BGCLUT44;
	volatile	uint32_t	BGCLUT45;
	volatile	uint32_t	BGCLUT46;
	volatile	uint32_t	BGCLUT47;
	volatile	uint32_t	BGCLUT48;
	volatile	uint32_t	BGCLUT49;
	volatile	uint32_t	BGCLUT50;
	volatile	uint32_t	BGCLUT51;
	volatile	uint32_t	BGCLUT52;
	volatile	uint32_t	BGCLUT53;
	volatile	uint32_t	BGCLUT54;
	volatile	uint32_t	BGCLUT55;
	volatile	uint32_t	BGCLUT56;
	volatile	uint32_t	BGCLUT57;
	volatile	uint32_t	BGCLUT58;
	volatile	uint32_t	BGCLUT59;
	volatile	uint32_t	BGCLUT60;
	volatile	uint32_t	BGCLUT61;
	volatile	uint32_t	BGCLUT62;
	volatile	uint32_t	BGCLUT63;
	volatile	uint32_t	BGCLUT64;
	volatile	uint32_t	BGCLUT65;
	volatile	uint32_t	BGCLUT66;
	volatile	uint32_t	BGCLUT67;
	volatile	uint32_t	BGCLUT68;
	volatile	uint32_t	BGCLUT69;
	volatile	uint32_t	BGCLUT70;
	volatile	uint32_t	BGCLUT71;
	volatile	uint32_t	BGCLUT72;
	volatile	uint32_t	BGCLUT73;
	volatile	uint32_t	BGCLUT74;
	volatile	uint32_t	BGCLUT75;
	volatile	uint32_t	BGCLUT76;
	volatile	uint32_t	BGCLUT77;
	volatile	uint32_t	BGCLUT78;
	volatile	uint32_t	BGCLUT79;
	volatile	uint32_t	BGCLUT80;
	volatile	uint32_t	BGCLUT81;
	volatile	uint32_t	BGCLUT82;
	volatile	uint32_t	BGCLUT83;
	volatile	uint32_t	BGCLUT84;
	volatile	uint32_t	BGCLUT85;
	volatile	uint32_t	BGCLUT86;
	volatile	uint32_t	BGCLUT87;
	volatile	uint32_t	BGCLUT88;
	volatile	uint32_t	BGCLUT89;
	volatile	uint32_t	BGCLUT90;
	volatile	uint32_t	BGCLUT91;
	volatile	uint32_t	BGCLUT92;
	volatile	uint32_t	BGCLUT93;
	volatile	uint32_t	BGCLUT94;
	volatile	uint32_t	BGCLUT95;
	volatile	uint32_t	BGCLUT96;
	volatile	uint32_t	BGCLUT97;
	volatile	uint32_t	BGCLUT98;
	volatile	uint32_t	BGCLUT99;
	volatile	uint32_t	BGCLUT100;
	volatile	uint32_t	BGCLUT101;
	volatile	uint32_t	BGCLUT102;
	volatile	uint32_t	BGCLUT103;
	volatile	uint32_t	BGCLUT104;
	volatile	uint32_t	BGCLUT105;
	volatile	uint32_t	BGCLUT106;
	volatile	uint32_t	BGCLUT107;
	volatile	uint32_t	BGCLUT108;
	volatile	uint32_t	BGCLUT109;
	volatile	uint32_t	BGCLUT110;
	volatile	uint32_t	BGCLUT111;
	volatile	uint32_t	BGCLUT112;
	volatile	uint32_t	BGCLUT113;
	volatile	uint32_t	BGCLUT114;
	volatile	uint32_t	BGCLUT115;
	volatile	uint32_t	BGCLUT116;
	volatile	uint32_t	BGCLUT117;
	volatile	uint32_t	BGCLUT118;
	volatile	uint32_t	BGCLUT119;
	volatile	uint32_t	BGCLUT120;
	volatile	uint32_t	BGCLUT121;
	volatile	uint32_t	BGCLUT122;
	volatile	uint32_t	BGCLUT123;
	volatile	uint32_t	BGCLUT124;
	volatile	uint32_t	BGCLUT125;
	volatile	uint32_t	BGCLUT126;
	volatile	uint32_t	BGCLUT127;
	volatile	uint32_t	BGCLUT128;
	volatile	uint32_t	BGCLUT129;
	volatile	uint32_t	BGCLUT130;
	volatile	uint32_t	BGCLUT131;
	volatile	uint32_t	BGCLUT132;
	volatile	uint32_t	BGCLUT133;
	volatile	uint32_t	BGCLUT134;
	volatile	uint32_t	BGCLUT135;
	volatile	uint32_t	BGCLUT136;
	volatile	uint32_t	BGCLUT137;
	volatile	uint32_t	BGCLUT138;
	volatile	uint32_t	BGCLUT139;
	volatile	uint32_t	BGCLUT140;
	volatile	uint32_t	BGCLUT141;
	volatile	uint32_t	BGCLUT142;
	volatile	uint32_t	BGCLUT143;
	volatile	uint32_t	BGCLUT144;
	volatile	uint32_t	BGCLUT145;
	volatile	uint32_t	BGCLUT146;
	volatile	uint32_t	BGCLUT147;
	volatile	uint32_t	BGCLUT148;
	volatile	uint32_t	BGCLUT149;
	volatile	uint32_t	BGCLUT150;
	volatile	uint32_t	BGCLUT151;
	volatile	uint32_t	BGCLUT152;
	volatile	uint32_t	BGCLUT153;
	volatile	uint32_t	BGCLUT154;
	volatile	uint32_t	BGCLUT155;
	volatile	uint32_t	BGCLUT156;
	volatile	uint32_t	BGCLUT157;
	volatile	uint32_t	BGCLUT158;
	volatile	uint32_t	BGCLUT159;
	volatile	uint32_t	BGCLUT160;
	volatile	uint32_t	BGCLUT161;
	volatile	uint32_t	BGCLUT162;
	volatile	uint32_t	BGCLUT163;
	volatile	uint32_t	BGCLUT164;
	volatile	uint32_t	BGCLUT165;
	volatile	uint32_t	BGCLUT166;
	volatile	uint32_t	BGCLUT167;
	volatile	uint32_t	BGCLUT168;
	volatile	uint32_t	BGCLUT169;
	volatile	uint32_t	BGCLUT170;
	volatile	uint32_t	BGCLUT171;
	volatile	uint32_t	BGCLUT172;
	volatile	uint32_t	BGCLUT173;
	volatile	uint32_t	BGCLUT174;
	volatile	uint32_t	BGCLUT175;
	volatile	uint32_t	BGCLUT176;
	volatile	uint32_t	BGCLUT177;
	volatile	uint32_t	BGCLUT178;
	volatile	uint32_t	BGCLUT179;
	volatile	uint32_t	BGCLUT180;
	volatile	uint32_t	BGCLUT181;
	volatile	uint32_t	BGCLUT182;
	volatile	uint32_t	BGCLUT183;
	volatile	uint32_t	BGCLUT184;
	volatile	uint32_t	BGCLUT185;
	volatile	uint32_t	BGCLUT186;
	volatile	uint32_t	BGCLUT187;
	volatile	uint32_t	BGCLUT188;
	volatile	uint32_t	BGCLUT189;
	volatile	uint32_t	BGCLUT190;
	volatile	uint32_t	BGCLUT191;
	volatile	uint32_t	BGCLUT192;
	volatile	uint32_t	BGCLUT193;
	volatile	uint32_t	BGCLUT194;
	volatile	uint32_t	BGCLUT195;
	volatile	uint32_t	BGCLUT196;
	volatile	uint32_t	BGCLUT197;
	volatile	uint32_t	BGCLUT198;
	volatile	uint32_t	BGCLUT199;
	volatile	uint32_t	BGCLUT200;
	volatile	uint32_t	BGCLUT201;
	volatile	uint32_t	BGCLUT202;
	volatile	uint32_t	BGCLUT203;
	volatile	uint32_t	BGCLUT204;
	volatile	uint32_t	BGCLUT205;
	volatile	uint32_t	BGCLUT206;
	volatile	uint32_t	BGCLUT207;
	volatile	uint32_t	BGCLUT208;
	volatile	uint32_t	BGCLUT209;
	volatile	uint32_t	BGCLUT210;
	volatile	uint32_t	BGCLUT211;
	volatile	uint32_t	BGCLUT212;
	volatile	uint32_t	BGCLUT213;
	volatile	uint32_t	BGCLUT214;
	volatile	uint32_t	BGCLUT215;
	volatile	uint32_t	BGCLUT216;
	volatile	uint32_t	BGCLUT217;
	volatile	uint32_t	BGCLUT218;
	volatile	uint32_t	BGCLUT219;
	volatile	uint32_t	BGCLUT220;
	volatile	uint32_t	BGCLUT221;
	volatile	uint32_t	BGCLUT222;
	volatile	uint32_t	BGCLUT223;
	volatile	uint32_t	BGCLUT224;
	volatile	uint32_t	BGCLUT225;
	volatile	uint32_t	BGCLUT226;
	volatile	uint32_t	BGCLUT227;
	volatile	uint32_t	BGCLUT228;
	volatile	uint32_t	BGCLUT229;
	volatile	uint32_t	BGCLUT230;
	volatile	uint32_t	BGCLUT231;
	volatile	uint32_t	BGCLUT232;
	volatile	uint32_t	BGCLUT233;
	volatile	uint32_t	BGCLUT234;
	volatile	uint32_t	BGCLUT235;
	volatile	uint32_t	BGCLUT236;
	volatile	uint32_t	BGCLUT237;
	volatile	uint32_t	BGCLUT238;
	volatile	uint32_t	BGCLUT239;
	volatile	uint32_t	BGCLUT240;
	volatile	uint32_t	BGCLUT241;
	volatile	uint32_t	BGCLUT242;
	volatile	uint32_t	BGCLUT243;
	volatile	uint32_t	BGCLUT244;
	volatile	uint32_t	BGCLUT245;
	volatile	uint32_t	BGCLUT246;
	volatile	uint32_t	BGCLUT247;
	volatile	uint32_t	BGCLUT248;
	volatile	uint32_t	BGCLUT249;
	volatile	uint32_t	BGCLUT250;
	volatile	uint32_t	BGCLUT251;
	volatile	uint32_t	BGCLUT252;
	volatile	uint32_t	BGCLUT253;
	volatile	uint32_t	BGCLUT254;
	volatile	uint32_t	BGCLUT255;
} DMA2D_TypeDef;

#if (defined(__cplusplus))
#define	DMA2D_NS	reinterpret_cast<DMA2D_TypeDef *>(0x48021000u)
#define	DMA2D_S		reinterpret_cast<DMA2D_TypeDef *>(0x58021000u)

#else
#define	DMA2D_NS	((DMA2D_TypeDef *)0x48021000u)
#define	DMA2D_S		((DMA2D_TypeDef *)0x58021000u)
#endif

