hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// CR Configuration

#define	DMA2D_CR_MODE				(0x7u<<16)
#define	DMA2D_CR_MODE_0				(0x1u<<16)
#define	DMA2D_CR_CEIE				(0x1u<<13)
#define	DMA2D_CR_CTCIE				(0x1u<<12)
#define	DMA2D_CR_CAEIE				(0x1u<<11)
#define	DMA2D_CR_TWIE				(0x1u<<10)
#define	DMA2D_CR_TCIE				(0x1u<<9)
#define	DMA2D_CR_TEIE				(0x1u<<8)
#define	DMA2D_CR_LOM				(0x1u<<6)
#define	DMA2D_CR_ABORT				(0x1u<<2)
#define	DMA2D_CR_SUSP				(0x1u<<1)
#define	DMA2D_CR_START				(0x1u<<0)

#define	DMA2D_CR_MODE_B_0X0			(0x0u<<16)
#define	DMA2D_CR_MODE_B_0X1			(0x1u<<16)
#define	DMA2D_CR_MODE_B_0X2			(0x2u<<16)
#define	DMA2D_CR_MODE_B_0X3			(0x3u<<16)
#define	DMA2D_CR_MODE_B_0X4			(0x4u<<16)
#define	DMA2D_CR_MODE_B_0X5			(0x5u<<16)
#define	DMA2D_CR_CEIE_B_0X0			(0x0u<<13)
#define	DMA2D_CR_CEIE_B_0X1			(0x1u<<13)
#define	DMA2D_CR_CTCIE_B_0X0		(0x0u<<12)
#define	DMA2D_CR_CTCIE_B_0X1		(0x1u<<12)
#define	DMA2D_CR_CAEIE_B_0X0		(0x0u<<11)
#define	DMA2D_CR_CAEIE_B_0X1		(0x1u<<11)
#define	DMA2D_CR_TWIE_B_0X0			(0x0u<<10)
#define	DMA2D_CR_TWIE_B_0X1			(0x1u<<10)
#define	DMA2D_CR_TCIE_B_0X0			(0x0u<<9)
#define	DMA2D_CR_TCIE_B_0X1			(0x1u<<9)
#define	DMA2D_CR_TEIE_B_0X0			(0x0u<<8)
#define	DMA2D_CR_TEIE_B_0X1			(0x1u<<8)
#define	DMA2D_CR_LOM_B_0X0			(0x0u<<6)
#define	DMA2D_CR_LOM_B_0X1			(0x1u<<6)
#define	DMA2D_CR_ABORT_B_0X0		(0x0u<<2)
#define	DMA2D_CR_ABORT_B_0X1		(0x1u<<2)
#define	DMA2D_CR_SUSP_B_0X0			(0x0u<<1)
#define	DMA2D_CR_SUSP_B_0X1			(0x1u<<1)

// ISR Configuration

#define	DMA2D_ISR_CEIF				(0x1u<<5)
#define	DMA2D_ISR_CTCIF				(0x1u<<4)
#define	DMA2D_ISR_CAEIF				(0x1u<<3)
#define	DMA2D_ISR_TWIF				(0x1u<<2)
#define	DMA2D_ISR_TCIF				(0x1u<<1)
#define	DMA2D_ISR_TEIF				(0x1u<<0)

// IFCR Configuration

#define	DMA2D_IFCR_CCEIF			(0x1u<<5)
#define	DMA2D_IFCR_CCTCIF			(0x1u<<4)
#define	DMA2D_IFCR_CAECIF			(0x1u<<3)
#define	DMA2D_IFCR_CTWIF			(0x1u<<2)
#define	DMA2D_IFCR_CTCIF			(0x1u<<1)
#define	DMA2D_IFCR_CTEIF			(0x1u<<0)

// FGMAR Configuration

#define	DMA2D_FGMAR_MA				(0xFFFFFFFFu<<0)
#define	DMA2D_FGMAR_MA_0			(0x1u<<0)

// FGOR Configuration

#define	DMA2D_FGOR_LO				(0xFFFFu<<0)
#define	DMA2D_FGOR_LO_0				(0x1u<<0)

// BGMAR Configuration

#define	DMA2D_BGMAR_MA				(0xFFFFFFFFu<<0)
#define	DMA2D_BGMAR_MA_0			(0x1u<<0)

// BGOR Configuration

#define	DMA2D_BGOR_LO				(0xFFFFu<<0)
#define	DMA2D_BGOR_LO_0				(0x1u<<0)

// FGPFCCR Configuration

#define	DMA2D_FGPFCCR_ALPHA			(0xFFu<<24)
#define	DMA2D_FGPFCCR_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGPFCCR_RBS			(0x1u<<21)
#define	DMA2D_FGPFCCR_AI			(0x1u<<20)
#define	DMA2D_FGPFCCR_CSS			(0x3u<<18)
#define	DMA2D_FGPFCCR_CSS_0			(0x1u<<18)
#define	DMA2D_FGPFCCR_AM			(0x3u<<16)
#define	DMA2D_FGPFCCR_AM_0			(0x1u<<16)
#define	DMA2D_FGPFCCR_CS			(0xFFu<<8)
#define	DMA2D_FGPFCCR_CS_0			(0x1u<<8)
#define	DMA2D_FGPFCCR_START			(0x1u<<5)
#define	DMA2D_FGPFCCR_CCM			(0x1u<<4)
#define	DMA2D_FGPFCCR_CM			(0xFu<<0)
#define	DMA2D_FGPFCCR_CM_0			(0x1u<<0)

#define	DMA2D_FGPFCCR_RBS_B_0X0		(0x0u<<21)
#define	DMA2D_FGPFCCR_RBS_B_0X1		(0x1u<<21)
#define	DMA2D_FGPFCCR_AI_B_0X0		(0x0u<<20)
#define	DMA2D_FGPFCCR_AI_B_0X1		(0x1u<<20)
#define	DMA2D_FGPFCCR_CSS_B_0X0		(0x0u<<18)
#define	DMA2D_FGPFCCR_CSS_B_0X1		(0x1u<<18)
#define	DMA2D_FGPFCCR_CSS_B_0X2		(0x2u<<18)
#define	DMA2D_FGPFCCR_AM_B_0X0		(0x0u<<16)
#define	DMA2D_FGPFCCR_AM_B_0X1		(0x1u<<16)
#define	DMA2D_FGPFCCR_AM_B_0X2		(0x2u<<16)
#define	DMA2D_FGPFCCR_CCM_B_0X0		(0x0u<<4)
#define	DMA2D_FGPFCCR_CCM_B_0X1		(0x1u<<4)
#define	DMA2D_FGPFCCR_CM_B_0X0		(0x0u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X1		(0x1u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X2		(0x2u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X3		(0x3u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X4		(0x4u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X5		(0x5u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X6		(0x6u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X7		(0x7u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X8		(0x8u<<0)
#define	DMA2D_FGPFCCR_CM_B_0X9		(0x9u<<0)
#define	DMA2D_FGPFCCR_CM_B_0XA		(0xAu<<0)
#define	DMA2D_FGPFCCR_CM_B_0XB		(0xBu<<0)

// FGCOLR Configuration

#define	DMA2D_FGCOLR_RED			(0xFFu<<16)
#define	DMA2D_FGCOLR_RED_0			(0x1u<<16)
#define	DMA2D_FGCOLR_GREEN			(0xFFu<<8)
#define	DMA2D_FGCOLR_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCOLR_BLUE			(0xFFu<<0)
#define	DMA2D_FGCOLR_BLUE_0			(0x1u<<0)

// BGPFCCR Configuration

#define	DMA2D_BGPFCCR_ALPHA			(0xFFu<<24)
#define	DMA2D_BGPFCCR_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGPFCCR_RBS			(0x1u<<21)
#define	DMA2D_BGPFCCR_AI			(0x1u<<20)
#define	DMA2D_BGPFCCR_AM			(0x3u<<16)
#define	DMA2D_BGPFCCR_AM_0			(0x1u<<16)
#define	DMA2D_BGPFCCR_CS			(0xFFu<<8)
#define	DMA2D_BGPFCCR_CS_0			(0x1u<<8)
#define	DMA2D_BGPFCCR_START			(0x1u<<5)
#define	DMA2D_BGPFCCR_CCM			(0x1u<<4)
#define	DMA2D_BGPFCCR_CM			(0xFu<<0)
#define	DMA2D_BGPFCCR_CM_0			(0x1u<<0)

#define	DMA2D_BGPFCCR_RBS_B_0X0		(0x0u<<21)
#define	DMA2D_BGPFCCR_RBS_B_0X1		(0x1u<<21)
#define	DMA2D_BGPFCCR_AI_B_0X0		(0x0u<<20)
#define	DMA2D_BGPFCCR_AI_B_0X1		(0x1u<<20)
#define	DMA2D_BGPFCCR_AM_B_0X0		(0x0u<<16)
#define	DMA2D_BGPFCCR_AM_B_0X1		(0x1u<<16)
#define	DMA2D_BGPFCCR_AM_B_0X2		(0x2u<<16)
#define	DMA2D_BGPFCCR_CCM_B_0X0		(0x0u<<4)
#define	DMA2D_BGPFCCR_CCM_B_0X1		(0x1u<<4)
#define	DMA2D_BGPFCCR_CM_B_0X0		(0x0u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X1		(0x1u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X2		(0x2u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X3		(0x3u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X4		(0x4u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X5		(0x5u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X6		(0x6u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X7		(0x7u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X8		(0x8u<<0)
#define	DMA2D_BGPFCCR_CM_B_0X9		(0x9u<<0)
#define	DMA2D_BGPFCCR_CM_B_0XA		(0xAu<<0)

// BGCOLR Configuration

#define	DMA2D_BGCOLR_RED			(0xFFu<<16)
#define	DMA2D_BGCOLR_RED_0			(0x1u<<16)
#define	DMA2D_BGCOLR_GREEN			(0xFFu<<8)
#define	DMA2D_BGCOLR_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCOLR_BLUE			(0xFFu<<0)
#define	DMA2D_BGCOLR_BLUE_0			(0x1u<<0)

// FGCMAR Configuration

#define	DMA2D_FGCMAR_MA				(0xFFFFFFFFu<<0)
#define	DMA2D_FGCMAR_MA_0			(0x1u<<0)

// BGCMAR Configuration

#define	DMA2D_BGCMAR_MA				(0xFFFFFFFFu<<0)
#define	DMA2D_BGCMAR_MA_0			(0x1u<<0)

