hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// OPFCCR Configuration

#define	DMA2D_OPFCCR_RBS			(0x1u<<21)
#define	DMA2D_OPFCCR_AI				(0x1u<<20)
#define	DMA2D_OPFCCR_SB				(0x1u<<8)
#define	DMA2D_OPFCCR_CM				(0x7u<<0)
#define	DMA2D_OPFCCR_CM_0			(0x1u<<0)

#define	DMA2D_OPFCCR_RBS_B_0X0		(0x0u<<21)
#define	DMA2D_OPFCCR_RBS_B_0X1		(0x1u<<21)
#define	DMA2D_OPFCCR_AI_B_0X0		(0x0u<<20)
#define	DMA2D_OPFCCR_AI_B_0X1		(0x1u<<20)
#define	DMA2D_OPFCCR_SB_B_0X0		(0x0u<<8)
#define	DMA2D_OPFCCR_SB_B_0X1		(0x1u<<8)
#define	DMA2D_OPFCCR_CM_B_0X0		(0x0u<<0)
#define	DMA2D_OPFCCR_CM_B_0X1		(0x1u<<0)
#define	DMA2D_OPFCCR_CM_B_0X2		(0x2u<<0)
#define	DMA2D_OPFCCR_CM_B_0X3		(0x3u<<0)
#define	DMA2D_OPFCCR_CM_B_0X4		(0x4u<<0)

// OCOLR Configuration

#define	DMA2D_OCOLR_ALPHA			(0xFFu<<24)
#define	DMA2D_OCOLR_ALPHA_0			(0x1u<<24)
#define	DMA2D_OCOLR_RED				(0xFFu<<16)
#define	DMA2D_OCOLR_RED_0			(0x1u<<16)
#define	DMA2D_OCOLR_GREEN			(0xFFu<<8)
#define	DMA2D_OCOLR_GREEN_0			(0x1u<<8)
#define	DMA2D_OCOLR_BLUE			(0xFFu<<0)
#define	DMA2D_OCOLR_BLUE_0			(0x1u<<0)

// OMAR Configuration

#define	DMA2D_OMAR_MA				(0xFFFFFFFFu<<0)
#define	DMA2D_OMAR_MA_0				(0x1u<<0)

// OOR Configuration

#define	DMA2D_OOR_LO				(0xFFFFu<<0)
#define	DMA2D_OOR_LO_0				(0x1u<<0)

// NLR Configuration

#define	DMA2D_NLR_PL				(0x3FFFu<<16)
#define	DMA2D_NLR_PL_0				(0x1u<<16)
#define	DMA2D_NLR_NL				(0xFFFFu<<0)
#define	DMA2D_NLR_NL_0				(0x1u<<0)

// LWR Configuration

#define	DMA2D_LWR_LW				(0xFFFFu<<0)
#define	DMA2D_LWR_LW_0				(0x1u<<0)

// AMTCR Configuration

#define	DMA2D_AMTCR_DT				(0xFFu<<8)
#define	DMA2D_AMTCR_DT_0			(0x1u<<8)
#define	DMA2D_AMTCR_EN				(0x1u<<0)

// FGCLUT0 Configuration

#define	DMA2D_FGCLUT0_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT0_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT0_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT0_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT0_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT0_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT0_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT0_BLUE_0		(0x1u<<0)

// FGCLUT1 Configuration

#define	DMA2D_FGCLUT1_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT1_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT1_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT1_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT1_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT1_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT1_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT1_BLUE_0		(0x1u<<0)

// FGCLUT2 Configuration

#define	DMA2D_FGCLUT2_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT2_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT2_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT2_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT2_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT2_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT2_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT2_BLUE_0		(0x1u<<0)

// FGCLUT3 Configuration

#define	DMA2D_FGCLUT3_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT3_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT3_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT3_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT3_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT3_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT3_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT3_BLUE_0		(0x1u<<0)

// FGCLUT4 Configuration

#define	DMA2D_FGCLUT4_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT4_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT4_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT4_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT4_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT4_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT4_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT4_BLUE_0		(0x1u<<0)

// FGCLUT5 Configuration

#define	DMA2D_FGCLUT5_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT5_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT5_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT5_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT5_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT5_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT5_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT5_BLUE_0		(0x1u<<0)

// FGCLUT6 Configuration

#define	DMA2D_FGCLUT6_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT6_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT6_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT6_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT6_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT6_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT6_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT6_BLUE_0		(0x1u<<0)

// FGCLUT7 Configuration

#define	DMA2D_FGCLUT7_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT7_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT7_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT7_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT7_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT7_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT7_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT7_BLUE_0		(0x1u<<0)

// FGCLUT8 Configuration

#define	DMA2D_FGCLUT8_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT8_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT8_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT8_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT8_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT8_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT8_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT8_BLUE_0		(0x1u<<0)

// FGCLUT9 Configuration

#define	DMA2D_FGCLUT9_ALPHA			(0xFFu<<24)
#define	DMA2D_FGCLUT9_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT9_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT9_RED_0			(0x1u<<16)
#define	DMA2D_FGCLUT9_GREEN			(0xFFu<<8)
#define	DMA2D_FGCLUT9_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT9_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT9_BLUE_0		(0x1u<<0)

// FGCLUT10 Configuration

#define	DMA2D_FGCLUT10_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT10_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT10_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT10_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT10_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT10_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT10_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT10_BLUE_0		(0x1u<<0)

// FGCLUT11 Configuration

#define	DMA2D_FGCLUT11_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT11_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT11_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT11_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT11_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT11_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT11_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT11_BLUE_0		(0x1u<<0)

// FGCLUT12 Configuration

#define	DMA2D_FGCLUT12_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT12_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT12_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT12_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT12_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT12_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT12_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT12_BLUE_0		(0x1u<<0)

// FGCLUT13 Configuration

