hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_FGCLUT13_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT13_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT13_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT13_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT13_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT13_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT13_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT13_BLUE_0		(0x1u<<0)

// FGCLUT14 Configuration

#define	DMA2D_FGCLUT14_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT14_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT14_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT14_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT14_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT14_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT14_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT14_BLUE_0		(0x1u<<0)

// FGCLUT15 Configuration

#define	DMA2D_FGCLUT15_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT15_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT15_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT15_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT15_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT15_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT15_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT15_BLUE_0		(0x1u<<0)

// FGCLUT16 Configuration

#define	DMA2D_FGCLUT16_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT16_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT16_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT16_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT16_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT16_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT16_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT16_BLUE_0		(0x1u<<0)

// FGCLUT17 Configuration

#define	DMA2D_FGCLUT17_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT17_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT17_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT17_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT17_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT17_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT17_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT17_BLUE_0		(0x1u<<0)

// FGCLUT18 Configuration

#define	DMA2D_FGCLUT18_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT18_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT18_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT18_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT18_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT18_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT18_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT18_BLUE_0		(0x1u<<0)

// FGCLUT19 Configuration

#define	DMA2D_FGCLUT19_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT19_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT19_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT19_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT19_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT19_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT19_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT19_BLUE_0		(0x1u<<0)

// FGCLUT20 Configuration

#define	DMA2D_FGCLUT20_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT20_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT20_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT20_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT20_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT20_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT20_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT20_BLUE_0		(0x1u<<0)

// FGCLUT21 Configuration

#define	DMA2D_FGCLUT21_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT21_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT21_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT21_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT21_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT21_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT21_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT21_BLUE_0		(0x1u<<0)

// FGCLUT22 Configuration

#define	DMA2D_FGCLUT22_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT22_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT22_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT22_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT22_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT22_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT22_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT22_BLUE_0		(0x1u<<0)

// FGCLUT23 Configuration

#define	DMA2D_FGCLUT23_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT23_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT23_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT23_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT23_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT23_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT23_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT23_BLUE_0		(0x1u<<0)

// FGCLUT24 Configuration

#define	DMA2D_FGCLUT24_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT24_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT24_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT24_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT24_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT24_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT24_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT24_BLUE_0		(0x1u<<0)

// FGCLUT25 Configuration

#define	DMA2D_FGCLUT25_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT25_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT25_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT25_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT25_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT25_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT25_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT25_BLUE_0		(0x1u<<0)

// FGCLUT26 Configuration

#define	DMA2D_FGCLUT26_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT26_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT26_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT26_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT26_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT26_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT26_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT26_BLUE_0		(0x1u<<0)

// FGCLUT27 Configuration

#define	DMA2D_FGCLUT27_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT27_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT27_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT27_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT27_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT27_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT27_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT27_BLUE_0		(0x1u<<0)

// FGCLUT28 Configuration

#define	DMA2D_FGCLUT28_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT28_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT28_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT28_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT28_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT28_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT28_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT28_BLUE_0		(0x1u<<0)

// FGCLUT29 Configuration

#define	DMA2D_FGCLUT29_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT29_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT29_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT29_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT29_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT29_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT29_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT29_BLUE_0		(0x1u<<0)

// FGCLUT30 Configuration

#define	DMA2D_FGCLUT30_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT30_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT30_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT30_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT30_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT30_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT30_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT30_BLUE_0		(0x1u<<0)

// FGCLUT31 Configuration

#define	DMA2D_FGCLUT31_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT31_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT31_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT31_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT31_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT31_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT31_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT31_BLUE_0		(0x1u<<0)

// FGCLUT32 Configuration

#define	DMA2D_FGCLUT32_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT32_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT32_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT32_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT32_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT32_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT32_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT32_BLUE_0		(0x1u<<0)

// FGCLUT33 Configuration

#define	DMA2D_FGCLUT33_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT33_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT33_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT33_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT33_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT33_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT33_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT33_BLUE_0		(0x1u<<0)

