hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// FGCLUT34 Configuration

#define	DMA2D_FGCLUT34_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT34_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT34_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT34_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT34_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT34_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT34_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT34_BLUE_0		(0x1u<<0)

// FGCLUT35 Configuration

#define	DMA2D_FGCLUT35_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT35_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT35_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT35_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT35_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT35_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT35_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT35_BLUE_0		(0x1u<<0)

// FGCLUT36 Configuration

#define	DMA2D_FGCLUT36_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT36_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT36_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT36_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT36_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT36_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT36_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT36_BLUE_0		(0x1u<<0)

// FGCLUT37 Configuration

#define	DMA2D_FGCLUT37_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT37_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT37_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT37_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT37_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT37_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT37_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT37_BLUE_0		(0x1u<<0)

// FGCLUT38 Configuration

#define	DMA2D_FGCLUT38_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT38_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT38_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT38_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT38_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT38_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT38_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT38_BLUE_0		(0x1u<<0)

// FGCLUT39 Configuration

#define	DMA2D_FGCLUT39_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT39_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT39_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT39_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT39_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT39_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT39_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT39_BLUE_0		(0x1u<<0)

// FGCLUT40 Configuration

#define	DMA2D_FGCLUT40_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT40_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT40_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT40_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT40_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT40_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT40_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT40_BLUE_0		(0x1u<<0)

// FGCLUT41 Configuration

#define	DMA2D_FGCLUT41_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT41_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT41_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT41_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT41_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT41_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT41_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT41_BLUE_0		(0x1u<<0)

// FGCLUT42 Configuration

#define	DMA2D_FGCLUT42_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT42_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT42_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT42_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT42_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT42_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT42_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT42_BLUE_0		(0x1u<<0)

// FGCLUT43 Configuration

#define	DMA2D_FGCLUT43_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT43_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT43_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT43_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT43_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT43_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT43_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT43_BLUE_0		(0x1u<<0)

// FGCLUT44 Configuration

#define	DMA2D_FGCLUT44_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT44_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT44_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT44_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT44_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT44_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT44_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT44_BLUE_0		(0x1u<<0)

// FGCLUT45 Configuration

#define	DMA2D_FGCLUT45_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT45_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT45_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT45_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT45_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT45_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT45_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT45_BLUE_0		(0x1u<<0)

// FGCLUT46 Configuration

#define	DMA2D_FGCLUT46_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT46_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT46_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT46_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT46_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT46_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT46_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT46_BLUE_0		(0x1u<<0)

// FGCLUT47 Configuration

#define	DMA2D_FGCLUT47_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT47_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT47_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT47_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT47_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT47_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT47_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT47_BLUE_0		(0x1u<<0)

// FGCLUT48 Configuration

#define	DMA2D_FGCLUT48_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT48_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT48_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT48_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT48_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT48_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT48_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT48_BLUE_0		(0x1u<<0)

// FGCLUT49 Configuration

#define	DMA2D_FGCLUT49_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT49_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT49_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT49_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT49_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT49_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT49_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT49_BLUE_0		(0x1u<<0)

// FGCLUT50 Configuration

#define	DMA2D_FGCLUT50_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT50_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT50_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT50_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT50_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT50_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT50_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT50_BLUE_0		(0x1u<<0)

// FGCLUT51 Configuration

#define	DMA2D_FGCLUT51_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT51_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT51_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT51_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT51_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT51_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT51_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT51_BLUE_0		(0x1u<<0)

// FGCLUT52 Configuration

#define	DMA2D_FGCLUT52_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT52_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT52_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT52_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT52_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT52_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT52_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT52_BLUE_0		(0x1u<<0)

// FGCLUT53 Configuration

#define	DMA2D_FGCLUT53_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT53_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT53_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT53_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT53_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT53_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT53_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT53_BLUE_0		(0x1u<<0)

