hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// FGCLUT54 Configuration

#define	DMA2D_FGCLUT54_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT54_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT54_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT54_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT54_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT54_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT54_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT54_BLUE_0		(0x1u<<0)

// FGCLUT55 Configuration

#define	DMA2D_FGCLUT55_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT55_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT55_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT55_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT55_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT55_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT55_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT55_BLUE_0		(0x1u<<0)

// FGCLUT56 Configuration

#define	DMA2D_FGCLUT56_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT56_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT56_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT56_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT56_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT56_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT56_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT56_BLUE_0		(0x1u<<0)

// FGCLUT57 Configuration

#define	DMA2D_FGCLUT57_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT57_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT57_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT57_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT57_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT57_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT57_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT57_BLUE_0		(0x1u<<0)

// FGCLUT58 Configuration

#define	DMA2D_FGCLUT58_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT58_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT58_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT58_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT58_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT58_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT58_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT58_BLUE_0		(0x1u<<0)

// FGCLUT59 Configuration

#define	DMA2D_FGCLUT59_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT59_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT59_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT59_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT59_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT59_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT59_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT59_BLUE_0		(0x1u<<0)

// FGCLUT60 Configuration

#define	DMA2D_FGCLUT60_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT60_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT60_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT60_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT60_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT60_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT60_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT60_BLUE_0		(0x1u<<0)

// FGCLUT61 Configuration

#define	DMA2D_FGCLUT61_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT61_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT61_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT61_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT61_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT61_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT61_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT61_BLUE_0		(0x1u<<0)

// FGCLUT62 Configuration

#define	DMA2D_FGCLUT62_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT62_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT62_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT62_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT62_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT62_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT62_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT62_BLUE_0		(0x1u<<0)

// FGCLUT63 Configuration

#define	DMA2D_FGCLUT63_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT63_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT63_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT63_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT63_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT63_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT63_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT63_BLUE_0		(0x1u<<0)

// FGCLUT64 Configuration

#define	DMA2D_FGCLUT64_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT64_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT64_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT64_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT64_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT64_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT64_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT64_BLUE_0		(0x1u<<0)

// FGCLUT65 Configuration

#define	DMA2D_FGCLUT65_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT65_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT65_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT65_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT65_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT65_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT65_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT65_BLUE_0		(0x1u<<0)

// FGCLUT66 Configuration

#define	DMA2D_FGCLUT66_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT66_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT66_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT66_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT66_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT66_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT66_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT66_BLUE_0		(0x1u<<0)

// FGCLUT67 Configuration

#define	DMA2D_FGCLUT67_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT67_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT67_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT67_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT67_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT67_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT67_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT67_BLUE_0		(0x1u<<0)

// FGCLUT68 Configuration

#define	DMA2D_FGCLUT68_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT68_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT68_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT68_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT68_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT68_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT68_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT68_BLUE_0		(0x1u<<0)

// FGCLUT69 Configuration

#define	DMA2D_FGCLUT69_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT69_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT69_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT69_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT69_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT69_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT69_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT69_BLUE_0		(0x1u<<0)

// FGCLUT70 Configuration

#define	DMA2D_FGCLUT70_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT70_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT70_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT70_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT70_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT70_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT70_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT70_BLUE_0		(0x1u<<0)

