hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_FGCLUT88_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT88_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT88_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT88_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT88_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT88_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT88_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT88_BLUE_0		(0x1u<<0)

// FGCLUT89 Configuration

#define	DMA2D_FGCLUT89_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT89_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT89_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT89_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT89_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT89_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT89_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT89_BLUE_0		(0x1u<<0)

// FGCLUT90 Configuration

#define	DMA2D_FGCLUT90_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT90_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT90_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT90_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT90_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT90_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT90_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT90_BLUE_0		(0x1u<<0)

// FGCLUT91 Configuration

#define	DMA2D_FGCLUT91_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT91_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT91_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT91_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT91_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT91_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT91_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT91_BLUE_0		(0x1u<<0)

// FGCLUT92 Configuration

#define	DMA2D_FGCLUT92_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT92_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT92_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT92_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT92_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT92_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT92_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT92_BLUE_0		(0x1u<<0)

// FGCLUT93 Configuration

#define	DMA2D_FGCLUT93_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT93_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT93_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT93_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT93_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT93_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT93_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT93_BLUE_0		(0x1u<<0)

// FGCLUT94 Configuration

#define	DMA2D_FGCLUT94_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT94_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT94_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT94_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT94_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT94_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT94_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT94_BLUE_0		(0x1u<<0)

// FGCLUT95 Configuration

#define	DMA2D_FGCLUT95_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT95_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT95_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT95_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT95_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT95_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT95_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT95_BLUE_0		(0x1u<<0)

// FGCLUT96 Configuration

#define	DMA2D_FGCLUT96_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT96_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT96_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT96_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT96_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT96_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT96_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT96_BLUE_0		(0x1u<<0)

// FGCLUT97 Configuration

#define	DMA2D_FGCLUT97_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT97_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT97_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT97_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT97_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT97_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT97_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT97_BLUE_0		(0x1u<<0)

// FGCLUT98 Configuration

#define	DMA2D_FGCLUT98_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT98_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT98_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT98_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT98_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT98_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT98_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT98_BLUE_0		(0x1u<<0)

// FGCLUT99 Configuration

#define	DMA2D_FGCLUT99_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT99_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT99_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT99_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT99_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT99_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT99_BLUE			(0xFFu<<0)
#define	DMA2D_FGCLUT99_BLUE_0		(0x1u<<0)

// FGCLUT100 Configuration

#define	DMA2D_FGCLUT100_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT100_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT100_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT100_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT100_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT100_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT100_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT100_BLUE_0		(0x1u<<0)

// FGCLUT101 Configuration

#define	DMA2D_FGCLUT101_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT101_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT101_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT101_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT101_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT101_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT101_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT101_BLUE_0		(0x1u<<0)

// FGCLUT102 Configuration

#define	DMA2D_FGCLUT102_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT102_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT102_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT102_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT102_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT102_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT102_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT102_BLUE_0		(0x1u<<0)

// FGCLUT103 Configuration

#define	DMA2D_FGCLUT103_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT103_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT103_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT103_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT103_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT103_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT103_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT103_BLUE_0		(0x1u<<0)

// FGCLUT104 Configuration

#define	DMA2D_FGCLUT104_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT104_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT104_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT104_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT104_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT104_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT104_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT104_BLUE_0		(0x1u<<0)

// FGCLUT105 Configuration

#define	DMA2D_FGCLUT105_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT105_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT105_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT105_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT105_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT105_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT105_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT105_BLUE_0		(0x1u<<0)

