hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// FGCLUT142 Configuration

#define	DMA2D_FGCLUT142_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT142_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT142_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT142_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT142_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT142_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT142_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT142_BLUE_0		(0x1u<<0)

// FGCLUT143 Configuration

#define	DMA2D_FGCLUT143_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT143_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT143_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT143_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT143_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT143_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT143_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT143_BLUE_0		(0x1u<<0)

// FGCLUT144 Configuration

#define	DMA2D_FGCLUT144_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT144_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT144_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT144_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT144_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT144_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT144_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT144_BLUE_0		(0x1u<<0)

// FGCLUT145 Configuration

#define	DMA2D_FGCLUT145_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT145_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT145_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT145_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT145_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT145_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT145_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT145_BLUE_0		(0x1u<<0)

// FGCLUT146 Configuration

#define	DMA2D_FGCLUT146_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT146_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT146_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT146_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT146_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT146_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT146_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT146_BLUE_0		(0x1u<<0)

// FGCLUT147 Configuration

#define	DMA2D_FGCLUT147_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT147_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT147_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT147_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT147_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT147_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT147_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT147_BLUE_0		(0x1u<<0)

// FGCLUT148 Configuration

#define	DMA2D_FGCLUT148_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT148_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT148_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT148_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT148_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT148_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT148_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT148_BLUE_0		(0x1u<<0)

// FGCLUT149 Configuration

#define	DMA2D_FGCLUT149_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT149_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT149_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT149_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT149_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT149_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT149_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT149_BLUE_0		(0x1u<<0)

// FGCLUT150 Configuration

#define	DMA2D_FGCLUT150_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT150_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT150_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT150_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT150_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT150_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT150_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT150_BLUE_0		(0x1u<<0)

// FGCLUT151 Configuration

#define	DMA2D_FGCLUT151_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT151_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT151_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT151_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT151_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT151_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT151_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT151_BLUE_0		(0x1u<<0)

// FGCLUT152 Configuration

#define	DMA2D_FGCLUT152_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT152_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT152_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT152_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT152_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT152_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT152_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT152_BLUE_0		(0x1u<<0)

// FGCLUT153 Configuration

#define	DMA2D_FGCLUT153_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT153_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT153_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT153_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT153_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT153_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT153_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT153_BLUE_0		(0x1u<<0)

// FGCLUT154 Configuration

#define	DMA2D_FGCLUT154_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT154_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT154_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT154_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT154_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT154_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT154_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT154_BLUE_0		(0x1u<<0)

// FGCLUT155 Configuration

#define	DMA2D_FGCLUT155_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT155_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT155_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT155_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT155_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT155_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT155_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT155_BLUE_0		(0x1u<<0)

// FGCLUT156 Configuration

#define	DMA2D_FGCLUT156_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT156_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT156_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT156_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT156_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT156_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT156_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT156_BLUE_0		(0x1u<<0)

// FGCLUT157 Configuration

#define	DMA2D_FGCLUT157_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT157_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT157_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT157_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT157_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT157_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT157_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT157_BLUE_0		(0x1u<<0)

// FGCLUT158 Configuration

#define	DMA2D_FGCLUT158_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT158_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT158_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT158_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT158_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT158_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT158_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT158_BLUE_0		(0x1u<<0)

// FGCLUT159 Configuration

#define	DMA2D_FGCLUT159_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT159_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT159_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT159_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT159_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT159_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT159_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT159_BLUE_0		(0x1u<<0)

// FGCLUT160 Configuration

#define	DMA2D_FGCLUT160_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT160_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT160_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT160_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT160_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT160_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT160_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT160_BLUE_0		(0x1u<<0)

// FGCLUT161 Configuration

