hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_FGCLUT161_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT161_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT161_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT161_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT161_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT161_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT161_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT161_BLUE_0		(0x1u<<0)

// FGCLUT162 Configuration

#define	DMA2D_FGCLUT162_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT162_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT162_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT162_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT162_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT162_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT162_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT162_BLUE_0		(0x1u<<0)

// FGCLUT163 Configuration

#define	DMA2D_FGCLUT163_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT163_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT163_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT163_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT163_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT163_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT163_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT163_BLUE_0		(0x1u<<0)

// FGCLUT164 Configuration

#define	DMA2D_FGCLUT164_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT164_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT164_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT164_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT164_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT164_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT164_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT164_BLUE_0		(0x1u<<0)

// FGCLUT165 Configuration

#define	DMA2D_FGCLUT165_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT165_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT165_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT165_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT165_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT165_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT165_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT165_BLUE_0		(0x1u<<0)

// FGCLUT166 Configuration

#define	DMA2D_FGCLUT166_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT166_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT166_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT166_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT166_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT166_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT166_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT166_BLUE_0		(0x1u<<0)

// FGCLUT167 Configuration

#define	DMA2D_FGCLUT167_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT167_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT167_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT167_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT167_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT167_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT167_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT167_BLUE_0		(0x1u<<0)

// FGCLUT168 Configuration

#define	DMA2D_FGCLUT168_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT168_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT168_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT168_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT168_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT168_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT168_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT168_BLUE_0		(0x1u<<0)

// FGCLUT169 Configuration

#define	DMA2D_FGCLUT169_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT169_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT169_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT169_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT169_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT169_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT169_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT169_BLUE_0		(0x1u<<0)

// FGCLUT170 Configuration

#define	DMA2D_FGCLUT170_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT170_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT170_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT170_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT170_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT170_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT170_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT170_BLUE_0		(0x1u<<0)

// FGCLUT171 Configuration

#define	DMA2D_FGCLUT171_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT171_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT171_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT171_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT171_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT171_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT171_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT171_BLUE_0		(0x1u<<0)

// FGCLUT172 Configuration

#define	DMA2D_FGCLUT172_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT172_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT172_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT172_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT172_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT172_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT172_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT172_BLUE_0		(0x1u<<0)

// FGCLUT173 Configuration

#define	DMA2D_FGCLUT173_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT173_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT173_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT173_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT173_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT173_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT173_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT173_BLUE_0		(0x1u<<0)

// FGCLUT174 Configuration

#define	DMA2D_FGCLUT174_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT174_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT174_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT174_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT174_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT174_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT174_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT174_BLUE_0		(0x1u<<0)

// FGCLUT175 Configuration

#define	DMA2D_FGCLUT175_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT175_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT175_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT175_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT175_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT175_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT175_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT175_BLUE_0		(0x1u<<0)

// FGCLUT176 Configuration

#define	DMA2D_FGCLUT176_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT176_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT176_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT176_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT176_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT176_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT176_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT176_BLUE_0		(0x1u<<0)

// FGCLUT177 Configuration

#define	DMA2D_FGCLUT177_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT177_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT177_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT177_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT177_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT177_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT177_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT177_BLUE_0		(0x1u<<0)

