hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// FGCLUT178 Configuration

#define	DMA2D_FGCLUT178_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT178_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT178_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT178_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT178_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT178_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT178_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT178_BLUE_0		(0x1u<<0)

// FGCLUT179 Configuration

#define	DMA2D_FGCLUT179_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT179_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT179_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT179_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT179_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT179_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT179_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT179_BLUE_0		(0x1u<<0)

// FGCLUT180 Configuration

#define	DMA2D_FGCLUT180_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT180_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT180_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT180_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT180_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT180_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT180_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT180_BLUE_0		(0x1u<<0)

// FGCLUT181 Configuration

#define	DMA2D_FGCLUT181_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT181_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT181_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT181_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT181_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT181_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT181_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT181_BLUE_0		(0x1u<<0)

// FGCLUT182 Configuration

#define	DMA2D_FGCLUT182_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT182_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT182_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT182_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT182_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT182_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT182_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT182_BLUE_0		(0x1u<<0)

// FGCLUT183 Configuration

#define	DMA2D_FGCLUT183_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT183_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT183_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT183_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT183_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT183_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT183_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT183_BLUE_0		(0x1u<<0)

// FGCLUT184 Configuration

#define	DMA2D_FGCLUT184_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT184_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT184_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT184_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT184_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT184_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT184_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT184_BLUE_0		(0x1u<<0)

// FGCLUT185 Configuration

#define	DMA2D_FGCLUT185_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT185_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT185_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT185_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT185_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT185_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT185_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT185_BLUE_0		(0x1u<<0)

// FGCLUT186 Configuration

#define	DMA2D_FGCLUT186_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT186_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT186_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT186_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT186_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT186_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT186_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT186_BLUE_0		(0x1u<<0)

// FGCLUT187 Configuration

#define	DMA2D_FGCLUT187_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT187_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT187_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT187_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT187_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT187_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT187_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT187_BLUE_0		(0x1u<<0)

// FGCLUT188 Configuration

#define	DMA2D_FGCLUT188_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT188_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT188_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT188_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT188_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT188_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT188_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT188_BLUE_0		(0x1u<<0)

// FGCLUT189 Configuration

#define	DMA2D_FGCLUT189_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT189_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT189_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT189_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT189_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT189_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT189_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT189_BLUE_0		(0x1u<<0)

// FGCLUT190 Configuration

#define	DMA2D_FGCLUT190_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT190_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT190_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT190_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT190_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT190_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT190_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT190_BLUE_0		(0x1u<<0)

// FGCLUT191 Configuration

#define	DMA2D_FGCLUT191_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT191_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT191_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT191_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT191_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT191_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT191_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT191_BLUE_0		(0x1u<<0)

// FGCLUT192 Configuration

#define	DMA2D_FGCLUT192_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT192_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT192_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT192_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT192_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT192_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT192_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT192_BLUE_0		(0x1u<<0)

// FGCLUT193 Configuration

#define	DMA2D_FGCLUT193_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT193_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT193_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT193_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT193_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT193_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT193_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT193_BLUE_0		(0x1u<<0)

// FGCLUT194 Configuration

#define	DMA2D_FGCLUT194_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT194_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT194_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT194_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT194_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT194_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT194_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT194_BLUE_0		(0x1u<<0)

// FGCLUT195 Configuration

#define	DMA2D_FGCLUT195_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT195_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT195_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT195_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT195_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT195_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT195_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT195_BLUE_0		(0x1u<<0)

// FGCLUT196 Configuration

#define	DMA2D_FGCLUT196_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT196_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT196_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT196_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT196_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT196_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT196_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT196_BLUE_0		(0x1u<<0)

// FGCLUT197 Configuration

#define	DMA2D_FGCLUT197_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT197_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT197_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT197_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT197_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT197_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT197_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT197_BLUE_0		(0x1u<<0)

// FGCLUT198 Configuration

#define	DMA2D_FGCLUT198_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT198_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT198_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT198_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT198_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT198_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT198_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT198_BLUE_0		(0x1u<<0)

// FGCLUT199 Configuration

