hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_FGCLUT199_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT199_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT199_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT199_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT199_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT199_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT199_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT199_BLUE_0		(0x1u<<0)

// FGCLUT200 Configuration

#define	DMA2D_FGCLUT200_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT200_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT200_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT200_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT200_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT200_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT200_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT200_BLUE_0		(0x1u<<0)

// FGCLUT201 Configuration

#define	DMA2D_FGCLUT201_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT201_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT201_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT201_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT201_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT201_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT201_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT201_BLUE_0		(0x1u<<0)

// FGCLUT202 Configuration

#define	DMA2D_FGCLUT202_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT202_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT202_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT202_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT202_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT202_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT202_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT202_BLUE_0		(0x1u<<0)

// FGCLUT203 Configuration

#define	DMA2D_FGCLUT203_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT203_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT203_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT203_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT203_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT203_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT203_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT203_BLUE_0		(0x1u<<0)

// FGCLUT204 Configuration

#define	DMA2D_FGCLUT204_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT204_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT204_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT204_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT204_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT204_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT204_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT204_BLUE_0		(0x1u<<0)

// FGCLUT205 Configuration

#define	DMA2D_FGCLUT205_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT205_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT205_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT205_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT205_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT205_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT205_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT205_BLUE_0		(0x1u<<0)

// FGCLUT206 Configuration

#define	DMA2D_FGCLUT206_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT206_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT206_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT206_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT206_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT206_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT206_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT206_BLUE_0		(0x1u<<0)

// FGCLUT207 Configuration

#define	DMA2D_FGCLUT207_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT207_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT207_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT207_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT207_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT207_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT207_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT207_BLUE_0		(0x1u<<0)

// FGCLUT208 Configuration

#define	DMA2D_FGCLUT208_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT208_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT208_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT208_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT208_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT208_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT208_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT208_BLUE_0		(0x1u<<0)

// FGCLUT209 Configuration

#define	DMA2D_FGCLUT209_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT209_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT209_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT209_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT209_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT209_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT209_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT209_BLUE_0		(0x1u<<0)

// FGCLUT210 Configuration

#define	DMA2D_FGCLUT210_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT210_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT210_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT210_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT210_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT210_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT210_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT210_BLUE_0		(0x1u<<0)

// FGCLUT211 Configuration

#define	DMA2D_FGCLUT211_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT211_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT211_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT211_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT211_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT211_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT211_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT211_BLUE_0		(0x1u<<0)

// FGCLUT212 Configuration

#define	DMA2D_FGCLUT212_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT212_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT212_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT212_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT212_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT212_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT212_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT212_BLUE_0		(0x1u<<0)

// FGCLUT213 Configuration

#define	DMA2D_FGCLUT213_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT213_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT213_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT213_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT213_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT213_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT213_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT213_BLUE_0		(0x1u<<0)

// FGCLUT214 Configuration

#define	DMA2D_FGCLUT214_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT214_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT214_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT214_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT214_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT214_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT214_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT214_BLUE_0		(0x1u<<0)

// FGCLUT215 Configuration

#define	DMA2D_FGCLUT215_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT215_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT215_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT215_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT215_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT215_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT215_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT215_BLUE_0		(0x1u<<0)

// FGCLUT216 Configuration

#define	DMA2D_FGCLUT216_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT216_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT216_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT216_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT216_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT216_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT216_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT216_BLUE_0		(0x1u<<0)

// FGCLUT217 Configuration

#define	DMA2D_FGCLUT217_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT217_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT217_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT217_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT217_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT217_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT217_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT217_BLUE_0		(0x1u<<0)

