hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_FGCLUT254_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT254_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT254_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT254_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT254_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT254_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT254_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT254_BLUE_0		(0x1u<<0)

// FGCLUT255 Configuration

#define	DMA2D_FGCLUT255_ALPHA		(0xFFu<<24)
#define	DMA2D_FGCLUT255_ALPHA_0		(0x1u<<24)
#define	DMA2D_FGCLUT255_RED			(0xFFu<<16)
#define	DMA2D_FGCLUT255_RED_0		(0x1u<<16)
#define	DMA2D_FGCLUT255_GREEN		(0xFFu<<8)
#define	DMA2D_FGCLUT255_GREEN_0		(0x1u<<8)
#define	DMA2D_FGCLUT255_BLUE		(0xFFu<<0)
#define	DMA2D_FGCLUT255_BLUE_0		(0x1u<<0)

// BGCLUT0 Configuration

#define	DMA2D_BGCLUT0_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT0_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT0_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT0_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT0_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT0_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT0_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT0_BLUE_0		(0x1u<<0)

// BGCLUT1 Configuration

#define	DMA2D_BGCLUT1_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT1_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT1_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT1_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT1_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT1_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT1_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT1_BLUE_0		(0x1u<<0)

// BGCLUT2 Configuration

#define	DMA2D_BGCLUT2_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT2_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT2_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT2_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT2_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT2_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT2_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT2_BLUE_0		(0x1u<<0)

// BGCLUT3 Configuration

#define	DMA2D_BGCLUT3_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT3_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT3_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT3_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT3_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT3_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT3_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT3_BLUE_0		(0x1u<<0)

// BGCLUT4 Configuration

#define	DMA2D_BGCLUT4_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT4_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT4_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT4_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT4_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT4_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT4_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT4_BLUE_0		(0x1u<<0)

// BGCLUT5 Configuration

#define	DMA2D_BGCLUT5_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT5_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT5_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT5_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT5_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT5_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT5_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT5_BLUE_0		(0x1u<<0)

// BGCLUT6 Configuration

#define	DMA2D_BGCLUT6_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT6_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT6_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT6_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT6_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT6_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT6_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT6_BLUE_0		(0x1u<<0)

// BGCLUT7 Configuration

#define	DMA2D_BGCLUT7_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT7_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT7_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT7_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT7_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT7_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT7_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT7_BLUE_0		(0x1u<<0)

// BGCLUT8 Configuration

#define	DMA2D_BGCLUT8_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT8_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT8_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT8_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT8_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT8_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT8_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT8_BLUE_0		(0x1u<<0)

// BGCLUT9 Configuration

#define	DMA2D_BGCLUT9_ALPHA			(0xFFu<<24)
#define	DMA2D_BGCLUT9_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT9_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT9_RED_0			(0x1u<<16)
#define	DMA2D_BGCLUT9_GREEN			(0xFFu<<8)
#define	DMA2D_BGCLUT9_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT9_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT9_BLUE_0		(0x1u<<0)

// BGCLUT10 Configuration

#define	DMA2D_BGCLUT10_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT10_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT10_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT10_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT10_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT10_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT10_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT10_BLUE_0		(0x1u<<0)

// BGCLUT11 Configuration

#define	DMA2D_BGCLUT11_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT11_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT11_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT11_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT11_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT11_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT11_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT11_BLUE_0		(0x1u<<0)

// BGCLUT12 Configuration

#define	DMA2D_BGCLUT12_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT12_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT12_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT12_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT12_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT12_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT12_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT12_BLUE_0		(0x1u<<0)

// BGCLUT13 Configuration

#define	DMA2D_BGCLUT13_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT13_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT13_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT13_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT13_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT13_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT13_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT13_BLUE_0		(0x1u<<0)

// BGCLUT14 Configuration

#define	DMA2D_BGCLUT14_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT14_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT14_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT14_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT14_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT14_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT14_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT14_BLUE_0		(0x1u<<0)

// BGCLUT15 Configuration

