hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT15_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT15_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT15_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT15_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT15_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT15_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT15_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT15_BLUE_0		(0x1u<<0)

// BGCLUT16 Configuration

#define	DMA2D_BGCLUT16_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT16_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT16_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT16_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT16_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT16_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT16_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT16_BLUE_0		(0x1u<<0)

// BGCLUT17 Configuration

#define	DMA2D_BGCLUT17_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT17_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT17_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT17_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT17_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT17_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT17_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT17_BLUE_0		(0x1u<<0)

// BGCLUT18 Configuration

#define	DMA2D_BGCLUT18_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT18_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT18_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT18_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT18_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT18_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT18_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT18_BLUE_0		(0x1u<<0)

// BGCLUT19 Configuration

#define	DMA2D_BGCLUT19_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT19_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT19_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT19_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT19_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT19_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT19_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT19_BLUE_0		(0x1u<<0)

// BGCLUT20 Configuration

#define	DMA2D_BGCLUT20_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT20_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT20_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT20_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT20_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT20_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT20_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT20_BLUE_0		(0x1u<<0)

// BGCLUT21 Configuration

#define	DMA2D_BGCLUT21_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT21_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT21_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT21_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT21_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT21_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT21_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT21_BLUE_0		(0x1u<<0)

// BGCLUT22 Configuration

#define	DMA2D_BGCLUT22_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT22_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT22_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT22_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT22_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT22_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT22_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT22_BLUE_0		(0x1u<<0)

// BGCLUT23 Configuration

#define	DMA2D_BGCLUT23_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT23_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT23_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT23_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT23_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT23_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT23_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT23_BLUE_0		(0x1u<<0)

// BGCLUT24 Configuration

#define	DMA2D_BGCLUT24_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT24_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT24_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT24_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT24_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT24_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT24_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT24_BLUE_0		(0x1u<<0)

// BGCLUT25 Configuration

#define	DMA2D_BGCLUT25_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT25_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT25_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT25_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT25_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT25_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT25_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT25_BLUE_0		(0x1u<<0)

// BGCLUT26 Configuration

#define	DMA2D_BGCLUT26_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT26_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT26_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT26_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT26_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT26_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT26_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT26_BLUE_0		(0x1u<<0)

// BGCLUT27 Configuration

#define	DMA2D_BGCLUT27_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT27_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT27_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT27_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT27_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT27_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT27_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT27_BLUE_0		(0x1u<<0)

// BGCLUT28 Configuration

#define	DMA2D_BGCLUT28_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT28_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT28_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT28_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT28_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT28_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT28_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT28_BLUE_0		(0x1u<<0)

// BGCLUT29 Configuration

#define	DMA2D_BGCLUT29_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT29_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT29_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT29_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT29_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT29_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT29_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT29_BLUE_0		(0x1u<<0)

// BGCLUT30 Configuration

#define	DMA2D_BGCLUT30_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT30_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT30_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT30_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT30_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT30_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT30_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT30_BLUE_0		(0x1u<<0)

// BGCLUT31 Configuration

#define	DMA2D_BGCLUT31_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT31_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT31_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT31_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT31_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT31_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT31_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT31_BLUE_0		(0x1u<<0)

// BGCLUT32 Configuration

#define	DMA2D_BGCLUT32_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT32_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT32_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT32_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT32_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT32_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT32_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT32_BLUE_0		(0x1u<<0)

// BGCLUT33 Configuration

