hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT33_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT33_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT33_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT33_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT33_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT33_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT33_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT33_BLUE_0		(0x1u<<0)

// BGCLUT34 Configuration

#define	DMA2D_BGCLUT34_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT34_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT34_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT34_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT34_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT34_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT34_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT34_BLUE_0		(0x1u<<0)

// BGCLUT35 Configuration

#define	DMA2D_BGCLUT35_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT35_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT35_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT35_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT35_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT35_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT35_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT35_BLUE_0		(0x1u<<0)

// BGCLUT36 Configuration

#define	DMA2D_BGCLUT36_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT36_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT36_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT36_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT36_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT36_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT36_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT36_BLUE_0		(0x1u<<0)

// BGCLUT37 Configuration

#define	DMA2D_BGCLUT37_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT37_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT37_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT37_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT37_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT37_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT37_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT37_BLUE_0		(0x1u<<0)

// BGCLUT38 Configuration

#define	DMA2D_BGCLUT38_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT38_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT38_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT38_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT38_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT38_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT38_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT38_BLUE_0		(0x1u<<0)

// BGCLUT39 Configuration

#define	DMA2D_BGCLUT39_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT39_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT39_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT39_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT39_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT39_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT39_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT39_BLUE_0		(0x1u<<0)

// BGCLUT40 Configuration

#define	DMA2D_BGCLUT40_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT40_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT40_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT40_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT40_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT40_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT40_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT40_BLUE_0		(0x1u<<0)

// BGCLUT41 Configuration

#define	DMA2D_BGCLUT41_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT41_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT41_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT41_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT41_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT41_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT41_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT41_BLUE_0		(0x1u<<0)

// BGCLUT42 Configuration

#define	DMA2D_BGCLUT42_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT42_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT42_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT42_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT42_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT42_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT42_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT42_BLUE_0		(0x1u<<0)

// BGCLUT43 Configuration

#define	DMA2D_BGCLUT43_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT43_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT43_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT43_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT43_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT43_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT43_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT43_BLUE_0		(0x1u<<0)

// BGCLUT44 Configuration

#define	DMA2D_BGCLUT44_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT44_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT44_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT44_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT44_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT44_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT44_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT44_BLUE_0		(0x1u<<0)

// BGCLUT45 Configuration

#define	DMA2D_BGCLUT45_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT45_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT45_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT45_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT45_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT45_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT45_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT45_BLUE_0		(0x1u<<0)

// BGCLUT46 Configuration

#define	DMA2D_BGCLUT46_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT46_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT46_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT46_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT46_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT46_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT46_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT46_BLUE_0		(0x1u<<0)

// BGCLUT47 Configuration

#define	DMA2D_BGCLUT47_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT47_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT47_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT47_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT47_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT47_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT47_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT47_BLUE_0		(0x1u<<0)

// BGCLUT48 Configuration

#define	DMA2D_BGCLUT48_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT48_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT48_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT48_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT48_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT48_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT48_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT48_BLUE_0		(0x1u<<0)

// BGCLUT49 Configuration

#define	DMA2D_BGCLUT49_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT49_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT49_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT49_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT49_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT49_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT49_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT49_BLUE_0		(0x1u<<0)

// BGCLUT50 Configuration

