hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT50_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT50_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT50_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT50_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT50_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT50_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT50_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT50_BLUE_0		(0x1u<<0)

// BGCLUT51 Configuration

#define	DMA2D_BGCLUT51_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT51_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT51_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT51_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT51_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT51_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT51_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT51_BLUE_0		(0x1u<<0)

// BGCLUT52 Configuration

#define	DMA2D_BGCLUT52_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT52_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT52_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT52_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT52_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT52_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT52_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT52_BLUE_0		(0x1u<<0)

// BGCLUT53 Configuration

#define	DMA2D_BGCLUT53_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT53_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT53_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT53_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT53_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT53_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT53_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT53_BLUE_0		(0x1u<<0)

// BGCLUT54 Configuration

#define	DMA2D_BGCLUT54_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT54_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT54_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT54_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT54_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT54_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT54_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT54_BLUE_0		(0x1u<<0)

// BGCLUT55 Configuration

#define	DMA2D_BGCLUT55_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT55_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT55_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT55_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT55_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT55_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT55_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT55_BLUE_0		(0x1u<<0)

// BGCLUT56 Configuration

#define	DMA2D_BGCLUT56_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT56_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT56_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT56_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT56_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT56_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT56_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT56_BLUE_0		(0x1u<<0)

// BGCLUT57 Configuration

#define	DMA2D_BGCLUT57_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT57_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT57_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT57_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT57_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT57_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT57_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT57_BLUE_0		(0x1u<<0)

// BGCLUT58 Configuration

#define	DMA2D_BGCLUT58_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT58_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT58_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT58_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT58_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT58_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT58_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT58_BLUE_0		(0x1u<<0)

// BGCLUT59 Configuration

#define	DMA2D_BGCLUT59_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT59_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT59_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT59_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT59_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT59_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT59_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT59_BLUE_0		(0x1u<<0)

// BGCLUT60 Configuration

#define	DMA2D_BGCLUT60_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT60_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT60_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT60_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT60_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT60_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT60_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT60_BLUE_0		(0x1u<<0)

// BGCLUT61 Configuration

#define	DMA2D_BGCLUT61_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT61_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT61_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT61_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT61_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT61_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT61_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT61_BLUE_0		(0x1u<<0)

// BGCLUT62 Configuration

#define	DMA2D_BGCLUT62_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT62_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT62_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT62_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT62_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT62_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT62_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT62_BLUE_0		(0x1u<<0)

// BGCLUT63 Configuration

#define	DMA2D_BGCLUT63_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT63_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT63_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT63_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT63_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT63_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT63_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT63_BLUE_0		(0x1u<<0)

// BGCLUT64 Configuration

#define	DMA2D_BGCLUT64_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT64_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT64_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT64_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT64_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT64_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT64_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT64_BLUE_0		(0x1u<<0)

// BGCLUT65 Configuration

#define	DMA2D_BGCLUT65_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT65_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT65_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT65_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT65_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT65_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT65_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT65_BLUE_0		(0x1u<<0)

// BGCLUT66 Configuration

#define	DMA2D_BGCLUT66_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT66_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT66_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT66_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT66_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT66_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT66_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT66_BLUE_0		(0x1u<<0)

// BGCLUT67 Configuration

