hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT85_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT85_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT85_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT85_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT85_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT85_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT85_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT85_BLUE_0		(0x1u<<0)

// BGCLUT86 Configuration

#define	DMA2D_BGCLUT86_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT86_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT86_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT86_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT86_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT86_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT86_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT86_BLUE_0		(0x1u<<0)

// BGCLUT87 Configuration

#define	DMA2D_BGCLUT87_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT87_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT87_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT87_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT87_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT87_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT87_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT87_BLUE_0		(0x1u<<0)

// BGCLUT88 Configuration

#define	DMA2D_BGCLUT88_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT88_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT88_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT88_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT88_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT88_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT88_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT88_BLUE_0		(0x1u<<0)

// BGCLUT89 Configuration

#define	DMA2D_BGCLUT89_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT89_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT89_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT89_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT89_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT89_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT89_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT89_BLUE_0		(0x1u<<0)

// BGCLUT90 Configuration

#define	DMA2D_BGCLUT90_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT90_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT90_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT90_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT90_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT90_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT90_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT90_BLUE_0		(0x1u<<0)

// BGCLUT91 Configuration

#define	DMA2D_BGCLUT91_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT91_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT91_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT91_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT91_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT91_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT91_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT91_BLUE_0		(0x1u<<0)

// BGCLUT92 Configuration

#define	DMA2D_BGCLUT92_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT92_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT92_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT92_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT92_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT92_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT92_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT92_BLUE_0		(0x1u<<0)

// BGCLUT93 Configuration

#define	DMA2D_BGCLUT93_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT93_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT93_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT93_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT93_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT93_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT93_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT93_BLUE_0		(0x1u<<0)

// BGCLUT94 Configuration

#define	DMA2D_BGCLUT94_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT94_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT94_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT94_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT94_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT94_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT94_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT94_BLUE_0		(0x1u<<0)

// BGCLUT95 Configuration

#define	DMA2D_BGCLUT95_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT95_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT95_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT95_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT95_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT95_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT95_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT95_BLUE_0		(0x1u<<0)

// BGCLUT96 Configuration

#define	DMA2D_BGCLUT96_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT96_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT96_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT96_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT96_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT96_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT96_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT96_BLUE_0		(0x1u<<0)

// BGCLUT97 Configuration

#define	DMA2D_BGCLUT97_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT97_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT97_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT97_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT97_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT97_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT97_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT97_BLUE_0		(0x1u<<0)

// BGCLUT98 Configuration

#define	DMA2D_BGCLUT98_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT98_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT98_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT98_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT98_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT98_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT98_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT98_BLUE_0		(0x1u<<0)

// BGCLUT99 Configuration

#define	DMA2D_BGCLUT99_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT99_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT99_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT99_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT99_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT99_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT99_BLUE			(0xFFu<<0)
#define	DMA2D_BGCLUT99_BLUE_0		(0x1u<<0)

// BGCLUT100 Configuration

#define	DMA2D_BGCLUT100_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT100_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT100_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT100_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT100_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT100_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT100_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT100_BLUE_0		(0x1u<<0)

// BGCLUT101 Configuration

#define	DMA2D_BGCLUT101_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT101_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT101_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT101_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT101_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT101_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT101_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT101_BLUE_0		(0x1u<<0)

