hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT124_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT124_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT124_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT124_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT124_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT124_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT124_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT124_BLUE_0		(0x1u<<0)

// BGCLUT125 Configuration

#define	DMA2D_BGCLUT125_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT125_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT125_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT125_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT125_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT125_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT125_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT125_BLUE_0		(0x1u<<0)

// BGCLUT126 Configuration

#define	DMA2D_BGCLUT126_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT126_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT126_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT126_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT126_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT126_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT126_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT126_BLUE_0		(0x1u<<0)

// BGCLUT127 Configuration

#define	DMA2D_BGCLUT127_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT127_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT127_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT127_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT127_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT127_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT127_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT127_BLUE_0		(0x1u<<0)

// BGCLUT128 Configuration

#define	DMA2D_BGCLUT128_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT128_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT128_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT128_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT128_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT128_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT128_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT128_BLUE_0		(0x1u<<0)

// BGCLUT129 Configuration

#define	DMA2D_BGCLUT129_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT129_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT129_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT129_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT129_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT129_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT129_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT129_BLUE_0		(0x1u<<0)

// BGCLUT130 Configuration

#define	DMA2D_BGCLUT130_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT130_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT130_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT130_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT130_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT130_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT130_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT130_BLUE_0		(0x1u<<0)

// BGCLUT131 Configuration

#define	DMA2D_BGCLUT131_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT131_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT131_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT131_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT131_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT131_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT131_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT131_BLUE_0		(0x1u<<0)

// BGCLUT132 Configuration

#define	DMA2D_BGCLUT132_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT132_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT132_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT132_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT132_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT132_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT132_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT132_BLUE_0		(0x1u<<0)

// BGCLUT133 Configuration

#define	DMA2D_BGCLUT133_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT133_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT133_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT133_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT133_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT133_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT133_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT133_BLUE_0		(0x1u<<0)

// BGCLUT134 Configuration

#define	DMA2D_BGCLUT134_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT134_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT134_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT134_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT134_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT134_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT134_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT134_BLUE_0		(0x1u<<0)

// BGCLUT135 Configuration

#define	DMA2D_BGCLUT135_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT135_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT135_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT135_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT135_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT135_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT135_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT135_BLUE_0		(0x1u<<0)

// BGCLUT136 Configuration

#define	DMA2D_BGCLUT136_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT136_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT136_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT136_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT136_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT136_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT136_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT136_BLUE_0		(0x1u<<0)

// BGCLUT137 Configuration

#define	DMA2D_BGCLUT137_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT137_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT137_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT137_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT137_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT137_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT137_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT137_BLUE_0		(0x1u<<0)

// BGCLUT138 Configuration

#define	DMA2D_BGCLUT138_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT138_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT138_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT138_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT138_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT138_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT138_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT138_BLUE_0		(0x1u<<0)

// BGCLUT139 Configuration

#define	DMA2D_BGCLUT139_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT139_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT139_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT139_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT139_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT139_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT139_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT139_BLUE_0		(0x1u<<0)

// BGCLUT140 Configuration

#define	DMA2D_BGCLUT140_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT140_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT140_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT140_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT140_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT140_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT140_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT140_BLUE_0		(0x1u<<0)

// BGCLUT141 Configuration

#define	DMA2D_BGCLUT141_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT141_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT141_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT141_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT141_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT141_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT141_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT141_BLUE_0		(0x1u<<0)

// BGCLUT142 Configuration

#define	DMA2D_BGCLUT142_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT142_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT142_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT142_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT142_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT142_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT142_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT142_BLUE_0		(0x1u<<0)

// BGCLUT143 Configuration

#define	DMA2D_BGCLUT143_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT143_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT143_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT143_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT143_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT143_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT143_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT143_BLUE_0		(0x1u<<0)

// BGCLUT144 Configuration

#define	DMA2D_BGCLUT144_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT144_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT144_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT144_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT144_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT144_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT144_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT144_BLUE_0		(0x1u<<0)

// BGCLUT145 Configuration

