hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT145_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT145_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT145_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT145_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT145_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT145_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT145_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT145_BLUE_0		(0x1u<<0)

// BGCLUT146 Configuration

#define	DMA2D_BGCLUT146_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT146_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT146_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT146_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT146_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT146_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT146_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT146_BLUE_0		(0x1u<<0)

// BGCLUT147 Configuration

#define	DMA2D_BGCLUT147_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT147_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT147_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT147_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT147_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT147_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT147_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT147_BLUE_0		(0x1u<<0)

// BGCLUT148 Configuration

#define	DMA2D_BGCLUT148_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT148_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT148_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT148_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT148_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT148_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT148_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT148_BLUE_0		(0x1u<<0)

// BGCLUT149 Configuration

#define	DMA2D_BGCLUT149_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT149_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT149_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT149_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT149_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT149_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT149_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT149_BLUE_0		(0x1u<<0)

// BGCLUT150 Configuration

#define	DMA2D_BGCLUT150_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT150_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT150_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT150_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT150_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT150_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT150_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT150_BLUE_0		(0x1u<<0)

// BGCLUT151 Configuration

#define	DMA2D_BGCLUT151_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT151_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT151_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT151_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT151_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT151_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT151_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT151_BLUE_0		(0x1u<<0)

// BGCLUT152 Configuration

#define	DMA2D_BGCLUT152_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT152_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT152_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT152_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT152_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT152_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT152_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT152_BLUE_0		(0x1u<<0)

// BGCLUT153 Configuration

#define	DMA2D_BGCLUT153_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT153_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT153_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT153_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT153_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT153_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT153_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT153_BLUE_0		(0x1u<<0)

// BGCLUT154 Configuration

#define	DMA2D_BGCLUT154_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT154_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT154_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT154_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT154_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT154_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT154_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT154_BLUE_0		(0x1u<<0)

// BGCLUT155 Configuration

#define	DMA2D_BGCLUT155_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT155_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT155_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT155_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT155_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT155_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT155_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT155_BLUE_0		(0x1u<<0)

// BGCLUT156 Configuration

#define	DMA2D_BGCLUT156_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT156_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT156_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT156_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT156_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT156_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT156_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT156_BLUE_0		(0x1u<<0)

// BGCLUT157 Configuration

#define	DMA2D_BGCLUT157_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT157_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT157_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT157_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT157_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT157_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT157_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT157_BLUE_0		(0x1u<<0)

// BGCLUT158 Configuration

#define	DMA2D_BGCLUT158_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT158_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT158_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT158_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT158_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT158_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT158_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT158_BLUE_0		(0x1u<<0)

// BGCLUT159 Configuration

#define	DMA2D_BGCLUT159_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT159_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT159_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT159_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT159_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT159_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT159_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT159_BLUE_0		(0x1u<<0)

// BGCLUT160 Configuration

#define	DMA2D_BGCLUT160_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT160_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT160_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT160_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT160_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT160_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT160_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT160_BLUE_0		(0x1u<<0)

// BGCLUT161 Configuration

#define	DMA2D_BGCLUT161_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT161_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT161_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT161_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT161_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT161_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT161_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT161_BLUE_0		(0x1u<<0)

