hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// BGCLUT162 Configuration

#define	DMA2D_BGCLUT162_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT162_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT162_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT162_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT162_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT162_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT162_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT162_BLUE_0		(0x1u<<0)

// BGCLUT163 Configuration

#define	DMA2D_BGCLUT163_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT163_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT163_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT163_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT163_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT163_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT163_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT163_BLUE_0		(0x1u<<0)

// BGCLUT164 Configuration

#define	DMA2D_BGCLUT164_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT164_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT164_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT164_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT164_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT164_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT164_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT164_BLUE_0		(0x1u<<0)

// BGCLUT165 Configuration

#define	DMA2D_BGCLUT165_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT165_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT165_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT165_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT165_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT165_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT165_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT165_BLUE_0		(0x1u<<0)

// BGCLUT166 Configuration

#define	DMA2D_BGCLUT166_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT166_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT166_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT166_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT166_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT166_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT166_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT166_BLUE_0		(0x1u<<0)

// BGCLUT167 Configuration

#define	DMA2D_BGCLUT167_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT167_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT167_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT167_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT167_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT167_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT167_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT167_BLUE_0		(0x1u<<0)

// BGCLUT168 Configuration

#define	DMA2D_BGCLUT168_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT168_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT168_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT168_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT168_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT168_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT168_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT168_BLUE_0		(0x1u<<0)

// BGCLUT169 Configuration

#define	DMA2D_BGCLUT169_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT169_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT169_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT169_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT169_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT169_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT169_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT169_BLUE_0		(0x1u<<0)

// BGCLUT170 Configuration

#define	DMA2D_BGCLUT170_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT170_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT170_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT170_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT170_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT170_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT170_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT170_BLUE_0		(0x1u<<0)

// BGCLUT171 Configuration

#define	DMA2D_BGCLUT171_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT171_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT171_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT171_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT171_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT171_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT171_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT171_BLUE_0		(0x1u<<0)

// BGCLUT172 Configuration

#define	DMA2D_BGCLUT172_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT172_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT172_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT172_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT172_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT172_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT172_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT172_BLUE_0		(0x1u<<0)

// BGCLUT173 Configuration

#define	DMA2D_BGCLUT173_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT173_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT173_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT173_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT173_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT173_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT173_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT173_BLUE_0		(0x1u<<0)

// BGCLUT174 Configuration

#define	DMA2D_BGCLUT174_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT174_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT174_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT174_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT174_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT174_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT174_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT174_BLUE_0		(0x1u<<0)

// BGCLUT175 Configuration

#define	DMA2D_BGCLUT175_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT175_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT175_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT175_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT175_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT175_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT175_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT175_BLUE_0		(0x1u<<0)

// BGCLUT176 Configuration

#define	DMA2D_BGCLUT176_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT176_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT176_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT176_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT176_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT176_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT176_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT176_BLUE_0		(0x1u<<0)

// BGCLUT177 Configuration

#define	DMA2D_BGCLUT177_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT177_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT177_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT177_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT177_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT177_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT177_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT177_BLUE_0		(0x1u<<0)

// BGCLUT178 Configuration

#define	DMA2D_BGCLUT178_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT178_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT178_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT178_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT178_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT178_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT178_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT178_BLUE_0		(0x1u<<0)

// BGCLUT179 Configuration

