hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT179_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT179_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT179_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT179_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT179_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT179_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT179_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT179_BLUE_0		(0x1u<<0)

// BGCLUT180 Configuration

#define	DMA2D_BGCLUT180_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT180_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT180_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT180_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT180_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT180_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT180_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT180_BLUE_0		(0x1u<<0)

// BGCLUT181 Configuration

#define	DMA2D_BGCLUT181_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT181_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT181_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT181_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT181_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT181_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT181_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT181_BLUE_0		(0x1u<<0)

// BGCLUT182 Configuration

#define	DMA2D_BGCLUT182_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT182_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT182_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT182_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT182_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT182_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT182_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT182_BLUE_0		(0x1u<<0)

// BGCLUT183 Configuration

#define	DMA2D_BGCLUT183_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT183_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT183_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT183_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT183_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT183_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT183_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT183_BLUE_0		(0x1u<<0)

// BGCLUT184 Configuration

#define	DMA2D_BGCLUT184_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT184_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT184_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT184_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT184_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT184_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT184_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT184_BLUE_0		(0x1u<<0)

// BGCLUT185 Configuration

#define	DMA2D_BGCLUT185_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT185_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT185_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT185_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT185_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT185_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT185_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT185_BLUE_0		(0x1u<<0)

// BGCLUT186 Configuration

#define	DMA2D_BGCLUT186_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT186_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT186_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT186_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT186_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT186_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT186_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT186_BLUE_0		(0x1u<<0)

// BGCLUT187 Configuration

#define	DMA2D_BGCLUT187_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT187_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT187_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT187_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT187_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT187_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT187_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT187_BLUE_0		(0x1u<<0)

// BGCLUT188 Configuration

#define	DMA2D_BGCLUT188_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT188_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT188_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT188_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT188_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT188_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT188_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT188_BLUE_0		(0x1u<<0)

// BGCLUT189 Configuration

#define	DMA2D_BGCLUT189_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT189_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT189_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT189_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT189_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT189_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT189_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT189_BLUE_0		(0x1u<<0)

// BGCLUT190 Configuration

#define	DMA2D_BGCLUT190_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT190_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT190_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT190_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT190_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT190_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT190_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT190_BLUE_0		(0x1u<<0)

// BGCLUT191 Configuration

#define	DMA2D_BGCLUT191_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT191_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT191_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT191_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT191_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT191_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT191_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT191_BLUE_0		(0x1u<<0)

// BGCLUT192 Configuration

#define	DMA2D_BGCLUT192_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT192_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT192_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT192_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT192_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT192_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT192_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT192_BLUE_0		(0x1u<<0)

// BGCLUT193 Configuration

#define	DMA2D_BGCLUT193_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT193_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT193_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT193_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT193_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT193_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT193_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT193_BLUE_0		(0x1u<<0)

// BGCLUT194 Configuration

#define	DMA2D_BGCLUT194_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT194_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT194_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT194_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT194_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT194_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT194_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT194_BLUE_0		(0x1u<<0)

// BGCLUT195 Configuration

#define	DMA2D_BGCLUT195_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT195_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT195_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT195_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT195_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT195_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT195_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT195_BLUE_0		(0x1u<<0)

// BGCLUT196 Configuration

#define	DMA2D_BGCLUT196_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT196_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT196_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT196_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT196_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT196_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT196_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT196_BLUE_0		(0x1u<<0)

// BGCLUT197 Configuration

#define	DMA2D_BGCLUT197_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT197_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT197_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT197_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT197_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT197_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT197_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT197_BLUE_0		(0x1u<<0)

