hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
#define	DMA2D_BGCLUT218_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT218_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT218_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT218_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT218_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT218_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT218_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT218_BLUE_0		(0x1u<<0)

// BGCLUT219 Configuration

#define	DMA2D_BGCLUT219_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT219_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT219_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT219_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT219_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT219_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT219_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT219_BLUE_0		(0x1u<<0)

// BGCLUT220 Configuration

#define	DMA2D_BGCLUT220_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT220_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT220_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT220_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT220_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT220_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT220_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT220_BLUE_0		(0x1u<<0)

// BGCLUT221 Configuration

#define	DMA2D_BGCLUT221_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT221_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT221_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT221_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT221_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT221_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT221_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT221_BLUE_0		(0x1u<<0)

// BGCLUT222 Configuration

#define	DMA2D_BGCLUT222_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT222_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT222_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT222_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT222_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT222_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT222_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT222_BLUE_0		(0x1u<<0)

// BGCLUT223 Configuration

#define	DMA2D_BGCLUT223_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT223_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT223_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT223_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT223_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT223_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT223_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT223_BLUE_0		(0x1u<<0)

// BGCLUT224 Configuration

#define	DMA2D_BGCLUT224_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT224_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT224_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT224_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT224_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT224_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT224_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT224_BLUE_0		(0x1u<<0)

// BGCLUT225 Configuration

#define	DMA2D_BGCLUT225_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT225_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT225_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT225_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT225_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT225_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT225_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT225_BLUE_0		(0x1u<<0)

// BGCLUT226 Configuration

#define	DMA2D_BGCLUT226_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT226_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT226_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT226_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT226_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT226_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT226_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT226_BLUE_0		(0x1u<<0)

// BGCLUT227 Configuration

#define	DMA2D_BGCLUT227_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT227_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT227_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT227_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT227_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT227_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT227_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT227_BLUE_0		(0x1u<<0)

// BGCLUT228 Configuration

#define	DMA2D_BGCLUT228_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT228_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT228_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT228_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT228_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT228_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT228_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT228_BLUE_0		(0x1u<<0)

// BGCLUT229 Configuration

#define	DMA2D_BGCLUT229_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT229_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT229_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT229_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT229_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT229_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT229_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT229_BLUE_0		(0x1u<<0)

// BGCLUT230 Configuration

#define	DMA2D_BGCLUT230_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT230_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT230_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT230_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT230_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT230_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT230_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT230_BLUE_0		(0x1u<<0)

// BGCLUT231 Configuration

#define	DMA2D_BGCLUT231_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT231_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT231_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT231_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT231_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT231_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT231_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT231_BLUE_0		(0x1u<<0)

// BGCLUT232 Configuration

#define	DMA2D_BGCLUT232_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT232_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT232_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT232_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT232_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT232_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT232_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT232_BLUE_0		(0x1u<<0)

// BGCLUT233 Configuration

#define	DMA2D_BGCLUT233_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT233_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT233_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT233_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT233_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT233_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT233_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT233_BLUE_0		(0x1u<<0)

// BGCLUT234 Configuration

#define	DMA2D_BGCLUT234_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT234_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT234_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT234_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT234_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT234_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT234_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT234_BLUE_0		(0x1u<<0)

