hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dma2d.h
// BGCLUT235 Configuration

#define	DMA2D_BGCLUT235_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT235_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT235_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT235_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT235_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT235_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT235_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT235_BLUE_0		(0x1u<<0)

// BGCLUT236 Configuration

#define	DMA2D_BGCLUT236_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT236_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT236_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT236_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT236_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT236_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT236_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT236_BLUE_0		(0x1u<<0)

// BGCLUT237 Configuration

#define	DMA2D_BGCLUT237_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT237_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT237_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT237_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT237_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT237_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT237_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT237_BLUE_0		(0x1u<<0)

// BGCLUT238 Configuration

#define	DMA2D_BGCLUT238_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT238_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT238_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT238_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT238_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT238_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT238_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT238_BLUE_0		(0x1u<<0)

// BGCLUT239 Configuration

#define	DMA2D_BGCLUT239_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT239_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT239_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT239_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT239_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT239_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT239_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT239_BLUE_0		(0x1u<<0)

// BGCLUT240 Configuration

#define	DMA2D_BGCLUT240_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT240_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT240_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT240_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT240_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT240_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT240_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT240_BLUE_0		(0x1u<<0)

// BGCLUT241 Configuration

#define	DMA2D_BGCLUT241_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT241_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT241_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT241_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT241_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT241_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT241_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT241_BLUE_0		(0x1u<<0)

// BGCLUT242 Configuration

#define	DMA2D_BGCLUT242_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT242_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT242_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT242_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT242_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT242_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT242_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT242_BLUE_0		(0x1u<<0)

// BGCLUT243 Configuration

#define	DMA2D_BGCLUT243_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT243_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT243_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT243_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT243_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT243_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT243_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT243_BLUE_0		(0x1u<<0)

// BGCLUT244 Configuration

#define	DMA2D_BGCLUT244_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT244_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT244_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT244_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT244_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT244_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT244_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT244_BLUE_0		(0x1u<<0)

// BGCLUT245 Configuration

#define	DMA2D_BGCLUT245_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT245_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT245_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT245_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT245_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT245_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT245_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT245_BLUE_0		(0x1u<<0)

// BGCLUT246 Configuration

#define	DMA2D_BGCLUT246_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT246_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT246_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT246_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT246_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT246_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT246_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT246_BLUE_0		(0x1u<<0)

// BGCLUT247 Configuration

#define	DMA2D_BGCLUT247_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT247_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT247_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT247_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT247_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT247_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT247_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT247_BLUE_0		(0x1u<<0)

// BGCLUT248 Configuration

#define	DMA2D_BGCLUT248_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT248_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT248_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT248_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT248_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT248_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT248_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT248_BLUE_0		(0x1u<<0)

// BGCLUT249 Configuration

#define	DMA2D_BGCLUT249_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT249_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT249_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT249_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT249_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT249_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT249_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT249_BLUE_0		(0x1u<<0)

// BGCLUT250 Configuration

#define	DMA2D_BGCLUT250_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT250_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT250_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT250_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT250_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT250_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT250_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT250_BLUE_0		(0x1u<<0)

// BGCLUT251 Configuration

#define	DMA2D_BGCLUT251_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT251_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT251_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT251_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT251_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT251_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT251_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT251_BLUE_0		(0x1u<<0)

// BGCLUT252 Configuration

#define	DMA2D_BGCLUT252_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT252_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT252_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT252_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT252_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT252_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT252_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT252_BLUE_0		(0x1u<<0)

// BGCLUT253 Configuration

#define	DMA2D_BGCLUT253_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT253_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT253_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT253_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT253_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT253_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT253_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT253_BLUE_0		(0x1u<<0)

// BGCLUT254 Configuration

#define	DMA2D_BGCLUT254_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT254_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT254_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT254_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT254_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT254_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT254_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT254_BLUE_0		(0x1u<<0)

// BGCLUT255 Configuration

#define	DMA2D_BGCLUT255_ALPHA		(0xFFu<<24)
#define	DMA2D_BGCLUT255_ALPHA_0		(0x1u<<24)
#define	DMA2D_BGCLUT255_RED			(0xFFu<<16)
#define	DMA2D_BGCLUT255_RED_0		(0x1u<<16)
#define	DMA2D_BGCLUT255_GREEN		(0xFFu<<8)
#define	DMA2D_BGCLUT255_GREEN_0		(0x1u<<8)
#define	DMA2D_BGCLUT255_BLUE		(0xFFu<<0)
#define	DMA2D_BGCLUT255_BLUE_0		(0x1u<<0)
